commit 9b14d1f8a76682124c5e465196685a9833ff526e
Author: Horatiu Vultur <horatiu.vultur@microchip.com>
Date:   Sun Jun 28 15:45:16 2020 +0200

    bridge: mrp: Fix endian conversion and some other warnings
    
    The following sparse warnings are fixed:
    net/bridge/br_mrp.c:106:18: warning: incorrect type in assignment (different base types)
    net/bridge/br_mrp.c:106:18:    expected unsigned short [usertype]
    net/bridge/br_mrp.c:106:18:    got restricted __be16 [usertype]
    net/bridge/br_mrp.c:281:23: warning: incorrect type in argument 1 (different modifiers)
    net/bridge/br_mrp.c:281:23:    expected struct list_head *entry
    net/bridge/br_mrp.c:281:23:    got struct list_head [noderef] *
    net/bridge/br_mrp.c:332:28: warning: incorrect type in argument 1 (different modifiers)
    net/bridge/br_mrp.c:332:28:    expected struct list_head *new
    net/bridge/br_mrp.c:332:28:    got struct list_head [noderef] *
    net/bridge/br_mrp.c:332:40: warning: incorrect type in argument 2 (different modifiers)
    net/bridge/br_mrp.c:332:40:    expected struct list_head *head
    net/bridge/br_mrp.c:332:40:    got struct list_head [noderef] *
    net/bridge/br_mrp.c:682:29: warning: incorrect type in argument 1 (different modifiers)
    net/bridge/br_mrp.c:682:29:    expected struct list_head const *head
    net/bridge/br_mrp.c:682:29:    got struct list_head [noderef] *
    
    Reported-by: kernel test robot <lkp@intel.com>

    This is immediately motivated by the bridge code that chains functions that
    call into netfilter.  Without passing net into the okfns the bridge code would
    need to guess about the best expression for the network namespace to process
    packets in.
    
    As net is frequently one of the first things computed in continuation functions
    after netfilter has done it's job passing in the desired network namespace is in
    many cases a code simplification.
    
    To support this change the function dst_output_okfn is introduced to
    simplify passing dst_output as an okfn.  For the moment dst_output_okfn
    just silently drops the struct net.
    
    Signed-off-by: "Eric W. Biederman" <ebiederm@xmission.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/net/bridge/br_private.h b/net/bridge/br_private.h
index 213baf7aaa93..74e99c75c8e4 100644
--- a/net/bridge/br_private.h
+++ b/net/bridge/br_private.h
@@ -413,10 +413,10 @@ int br_fdb_external_learn_del(struct net_bridge *br, struct net_bridge_port *p,
 
 /* br_forward.c */
 void br_deliver(const struct net_bridge_port *to, struct sk_buff *skb);
-int br_dev_queue_push_xmit(struct sock *sk, struct sk_buff *skb);
+int br_dev_queue_push_xmit(struct net *net, struct sock *sk, struct sk_buff *skb);
 void br_forward(const struct net_bridge_port *to,
 		struct sk_buff *skb, struct sk_buff *skb0);
-int br_forward_finish(struct sock *sk, struct sk_buff *skb);
+int br_forward_finish(struct net *net, struct sock *sk, struct sk_buff *skb);
 void br_flood_deliver(struct net_bridge *br, struct sk_buff *skb, bool unicast);
 void br_flood_forward(struct net_bridge *br, struct sk_buff *skb,
 		      struct sk_buff *skb2, bool unicast);
@@ -434,7 +434,7 @@ void br_port_flags_change(struct net_bridge_port *port, unsigned long mask);
 void br_manage_promisc(struct net_bridge *br);
 
 /* br_input.c */
-int br_handle_frame_finish(struct sock *sk, struct sk_buff *skb);
+int br_handle_frame_finish(struct net *net, struct sock *sk, struct sk_buff *skb);
 rx_handler_result_t br_handle_frame(struct sk_buff **pskb);
 
 static inline bool br_rx_handler_check_rcu(const struct net_device *dev)

commit b22fbf22f8469d8cacb6fcf5d266426826e1137d
Author: Nikolay Aleksandrov <nikolay@cumulusnetworks.com>
Date:   Thu Aug 27 14:19:20 2015 -0700

    bridge: fdb: rearrange net_bridge_fdb_entry
    
    While looking into fixing the local entries scalability issue I noticed
    that the structure is badly arranged because vlan_id would fall in a
    second cache line while keeping rcu which is used only when deleting
    in the first, so re-arrange the structure and push rcu to the end so we
    can get 16 bytes which can be used for other fields (by pushing rcu
    fully in the second 64 byte chunk). With this change all the core
    necessary information when doing fdb lookups will be available in a
    single cache line.
    
    pahole before (note vlan_id):
    struct net_bridge_fdb_entry {
            struct hlist_node          hlist;                /*     0    16 */
            struct net_bridge_port *   dst;                  /*    16     8 */
            struct callback_head       rcu;                  /*    24    16 */
            long unsigned int          updated;              /*    40     8 */
            long unsigned int          used;                 /*    48     8 */
            mac_addr                   addr;                 /*    56     6 */
            unsigned char              is_local:1;           /*    62: 7  1 */
            unsigned char              is_static:1;          /*    62: 6  1 */
            unsigned char              added_by_user:1;      /*    62: 5  1 */
            unsigned char              added_by_external_learn:1; /*    62: 4  1 */
    
            /* XXX 4 bits hole, try to pack */
            /* XXX 1 byte hole, try to pack */
    
            /* --- cacheline 1 boundary (64 bytes) --- */
            __u16                      vlan_id;              /*    64     2 */
    
            /* size: 72, cachelines: 2, members: 11 */
            /* sum members: 65, holes: 1, sum holes: 1 */
            /* bit holes: 1, sum bit holes: 4 bits */
            /* padding: 6 */
            /* last cacheline: 8 bytes */
    }
    
    pahole after (note vlan_id):
    struct net_bridge_fdb_entry {
            struct hlist_node          hlist;                /*     0    16 */
            struct net_bridge_port *   dst;                  /*    16     8 */
            long unsigned int          updated;              /*    24     8 */
            long unsigned int          used;                 /*    32     8 */
            mac_addr                   addr;                 /*    40     6 */
            __u16                      vlan_id;              /*    46     2 */
            unsigned char              is_local:1;           /*    48: 7  1 */
            unsigned char              is_static:1;          /*    48: 6  1 */
            unsigned char              added_by_user:1;      /*    48: 5  1 */
            unsigned char              added_by_external_learn:1; /*    48: 4  1 */
    
            /* XXX 4 bits hole, try to pack */
            /* XXX 7 bytes hole, try to pack */
    
            struct callback_head       rcu;                  /*    56    16 */
            /* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */
    
            /* size: 72, cachelines: 2, members: 11 */
            /* sum members: 65, holes: 1, sum holes: 7 */
            /* bit holes: 1, sum bit holes: 4 bits */
            /* last cacheline: 8 bytes */
    }
    
    Signed-off-by: Nikolay Aleksandrov <nikolay@cumulusnetworks.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/net/bridge/br_private.h b/net/bridge/br_private.h
index 19e8f79b6b99..213baf7aaa93 100644
--- a/net/bridge/br_private.h
+++ b/net/bridge/br_private.h
@@ -95,15 +95,15 @@ struct net_bridge_fdb_entry
 	struct hlist_node		hlist;
 	struct net_bridge_port		*dst;
 
-	struct rcu_head			rcu;
 	unsigned long			updated;
 	unsigned long			used;
 	mac_addr			addr;
+	__u16				vlan_id;
 	unsigned char			is_local:1,
 					is_static:1,
 					added_by_user:1,
 					added_by_external_learn:1;
-	__u16				vlan_id;
