commit 7eac52648a4c24ad23a05f62db97867c92a5747b
Author: Trond Myklebust <trond.myklebust@hammerspace.com>
Date:   Fri Feb 7 19:11:12 2020 -0500

    SUNRPC: Add a flag to avoid reference counts on credentials
    
    Add a flag to signal to the RPC layer that the credential is already
    pinned for the duration of the RPC call.
    
    Signed-off-by: Trond Myklebust <trond.myklebust@hammerspace.com>

diff --git a/include/linux/sunrpc/sched.h b/include/linux/sunrpc/sched.h
index a6ef35184ef1..df696efdd675 100644
--- a/include/linux/sunrpc/sched.h
+++ b/include/linux/sunrpc/sched.h
@@ -132,6 +132,7 @@ struct rpc_task_setup {
 #define RPC_TASK_TIMEOUT	0x1000		/* fail with ETIMEDOUT on timeout */
 #define RPC_TASK_NOCONNECT	0x2000		/* return ENOTCONN if not connected */
 #define RPC_TASK_NO_RETRANS_TIMEOUT	0x4000		/* wait forever for a reply */
+#define RPC_TASK_CRED_NOREF	0x8000		/* No refcount on the credential */
 
 #define RPC_IS_ASYNC(t)		((t)->tk_flags & RPC_TASK_ASYNC)
 #define RPC_IS_SWAPPER(t)	((t)->tk_flags & RPC_TASK_SWAPPER)

commit 972a2bf7dfe39ebf49dd47f68d27c416392e53b1
Merge: 7be3cb019db1 a8fd0feeca35
Author: Linus Torvalds <torvalds@linux-foundation.org>
Date:   Thu Sep 26 12:20:14 2019 -0700

    Merge tag 'nfs-for-5.4-1' of git://git.linux-nfs.org/projects/anna/linux-nfs
    
    Pull NFS client updates from Anna Schumaker:
     "Stable bugfixes:
       - Dequeue the request from the receive queue while we're re-encoding
         # v4.20+

    rpciod can easily get congested due to the long list of queued rpc_tasks.
    Having the receive queue wait in turn for those tasks to complete can
    therefore be a bottleneck.
    
    Address the problem by separating the workqueues into:
    - rpciod: manages rpc_tasks
    - xprtiod: manages transport related work.
    
    Signed-off-by: Trond Myklebust <trond.myklebust@primarydata.com>

diff --git a/include/linux/sunrpc/sched.h b/include/linux/sunrpc/sched.h
index 05a1809c44d9..ef780b3b5e31 100644
--- a/include/linux/sunrpc/sched.h
+++ b/include/linux/sunrpc/sched.h
@@ -247,6 +247,7 @@ void		rpc_show_tasks(struct net *);
 int		rpc_init_mempool(void);
 void		rpc_destroy_mempool(void);
 extern struct workqueue_struct *rpciod_workqueue;
+extern struct workqueue_struct *xprtiod_workqueue;
 void		rpc_prepare_task(struct rpc_task *task);
 
 static inline int rpc_wait_for_completion_task(struct rpc_task *task)

commit 9d61498d5f6cde68a708781bf2cd33cae21121dc
Author: Trond Myklebust <trond.myklebust@primarydata.com>
Date:   Sat Jan 30 18:13:05 2016 -0500

    SUNRPC: Allow caller to specify the transport to use
    
    This is needed in order to allow the NFSv4.1 backchannel and
    BIND_CONN_TO_SESSION function to work.
    
    Signed-off-by: Trond Myklebust <trond.myklebust@primarydata.com>

diff --git a/include/linux/sunrpc/sched.h b/include/linux/sunrpc/sched.h
index 0b248e98ee3b..05a1809c44d9 100644
--- a/include/linux/sunrpc/sched.h
+++ b/include/linux/sunrpc/sched.h
@@ -103,6 +103,7 @@ struct rpc_call_ops {
 struct rpc_task_setup {
 	struct rpc_task *task;
 	struct rpc_clnt *rpc_client;
+	struct rpc_xprt *rpc_xprt;
 	const struct rpc_message *rpc_message;
 	const struct rpc_call_ops *callback_ops;
 	void *callback_data;

commit fb43d17210baa538e58fc83d2d0f8a32399db73b
Author: Trond Myklebust <trond.myklebust@primarydata.com>
Date:   Sat Jan 30 16:39:26 2016 -0500

    SUNRPC: Use the multipath iterator to assign a transport to each task
    
    Signed-off-by: Trond Myklebust <trond.myklebust@primarydata.com>

diff --git a/include/linux/sunrpc/sched.h b/include/linux/sunrpc/sched.h
index ee0fbcf9b02e..0b248e98ee3b 100644
--- a/include/linux/sunrpc/sched.h
+++ b/include/linux/sunrpc/sched.h
@@ -69,6 +69,8 @@ struct rpc_task {
 	const struct rpc_call_ops *tk_ops;	/* Caller callbacks */
 
 	struct rpc_clnt *	tk_client;	/* RPC client */
+	struct rpc_xprt *	tk_xprt;	/* Transport */
+
 	struct rpc_rqst *	tk_rqstp;	/* RPC request */
 
 	struct workqueue_struct	*tk_workqueue;	/* Normally rpciod, but could

commit 5edd1051f4f3bd7cddcc91e346fdd22eee639c72
Author: Trond Myklebust <trond.myklebust@primarydata.com>
Date:   Wed Feb 25 14:49:16 2015 -0500

    SUNRPC: Reorder rpc_task to put waitqueue related info in same cachelines
    
    Try to group all the data required by the waitqueues, their timers and timer
    callbacks into the same cachelines for performance. With this reordering,
    "pahole" reports the following structure on x86_64:
    
    struct rpc_task {
            atomic_t                   tk_count;             /*     0     4 */
            int                        tk_status;            /*     4     4 */
            struct list_head           tk_task;              /*     8    16 */
            void                       (*tk_callback)(struct rpc_task *); /*    24
            void                       (*tk_action)(struct rpc_task *); /*    32
            long unsigned int          tk_timeout;           /*    40     8 */
            long unsigned int          tk_runstate;          /*    48     8 */
            struct rpc_wait_queue *    tk_waitqueue;         /*    56     8 */
            /* --- cacheline 1 boundary (64 bytes) --- */
            union {
                    struct work_struct tk_work;              /*          64 */
                    struct rpc_wait    tk_wait;              /*          56 */
            } u;                                             /*    64    64 */
            /* --- cacheline 2 boundary (128 bytes) --- */
            struct rpc_message         tk_msg;               /*   128    32 */
            void *                     tk_calldata;          /*   160     8 */
            const struct rpc_call_ops  * tk_ops;             /*   168     8 */
            struct rpc_clnt *          tk_client;            /*   176     8 */
            struct rpc_rqst *          tk_rqstp;             /*   184     8 */
            /* --- cacheline 3 boundary (192 bytes) --- */
            struct workqueue_struct *  tk_workqueue;         /*   192     8 */
            ktime_t                    tk_start;             /*   200     8 */
            pid_t                      tk_owner;             /*   208     4 */
            short unsigned int         tk_flags;             /*   212     2 */
            short unsigned int         tk_timeouts;          /*   214     2 */
            short unsigned int         tk_pid;               /*   216     2 */
            unsigned char              tk_priority:2;        /*   218: 6  1 */
            unsigned char              tk_garb_retry:2;      /*   218: 4  1 */
            unsigned char              tk_cred_retry:2;      /*   218: 2  1 */
            unsigned char              tk_rebind_retry:2;    /*   218: 0  1 */
    
            /* size: 224, cachelines: 4, members: 24 */
            /* padding: 5 */
            /* last cacheline: 32 bytes */
    };
    
    whereas on i386, it reports everything fitting into the 1st cacheline.
    
    Signed-off-by: Trond Myklebust <trond.myklebust@primarydata.com>

diff --git a/include/linux/sunrpc/sched.h b/include/linux/sunrpc/sched.h
index d703f0ef37d8..ee0fbcf9b02e 100644
--- a/include/linux/sunrpc/sched.h
+++ b/include/linux/sunrpc/sched.h
@@ -42,40 +42,41 @@ struct rpc_wait {
  */
 struct rpc_task {
 	atomic_t		tk_count;	/* Reference count */
+	int			tk_status;	/* result of last operation */
 	struct list_head	tk_task;	/* global list of tasks */
-	struct rpc_clnt *	tk_client;	/* RPC client */
-	struct rpc_rqst *	tk_rqstp;	/* RPC request */
-
-	/*
-	 * RPC call state
-	 */
-	struct rpc_message	tk_msg;		/* RPC call info */
 
 	/*
 	 * callback	to be executed after waking up
 	 * action	next procedure for async tasks
