commit 3466a8c15be8a0acea399f78fbe3764e14d7c11a
Author: Malcolm Priestley <tvboxspy@gmail.com>
Date:   Wed May 27 10:35:46 2020 +0100

    staging: vt6656: Fix warning: unused variable vnt_frame_time
    
    In commit 61bb798767e4
    ("staging: vt6656: vnt_get_rtscts_rsvtime_le replace with rts/cts duration.")
    not quite all of the code was removed.
    
    Remove unused vnt_frame_time variable.
    
    Reported-by: kbuild test robot <lkp@intel.com>
    Signed-off-by: Malcolm Priestley <tvboxspy@gmail.com>
    Link: https://lore.kernel.org/r/5096f399-03e7-77e1-b334-947aabc44d14@gmail.com
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

diff --git a/drivers/staging/vt6656/rxtx.c b/drivers/staging/vt6656/rxtx.c
index 5530c06ffd40..5dd6b4d2bf20 100644
--- a/drivers/staging/vt6656/rxtx.c
+++ b/drivers/staging/vt6656/rxtx.c
@@ -39,10 +39,6 @@ static const u16 vnt_time_stampoff[2][MAX_RATE] = {
 #define DATADUR_B       10
 #define DATADUR_A       11
 
-static const u16 vnt_frame_time[MAX_RATE] = {
-	10, 20, 55, 110, 24, 36, 48, 72, 96, 144, 192, 216
-};
-
 static const u8 vnt_phy_signal[] = {
 	0x00,	/* RATE_1M  */
 	0x01,	/* RATE_2M  */

commit 5f46e3cde5a42502595effbc7ba7d4e902bff2f0
Author: Malcolm Priestley <tvboxspy@gmail.com>
Date:   Wed May 27 09:54:44 2020 +0100

    staging: vt6656: Move vnt_tx_usb_header to vnt_tx_context
    
    Move the USB element out of vnt_tx_packet and vnt_beacon_xmit to

-		buf->data.duration = buf->duration_ba;
-		buf->data.frame_control =
-			cpu_to_le16(IEEE80211_FTYPE_CTL | IEEE80211_STYPE_CTS);
+	ether_addr_copy(buf->data.ra, priv->current_net_addr);
 
-		ether_addr_copy(buf->data.ra, priv->current_net_addr);
+	return vnt_rxtx_datahead_g_fb(tx_context, &buf->data_head);
+}
 
-		return vnt_rxtx_datahead_g(tx_context, &buf->data_head);
-	}
+static u16 vnt_fill_cts_head(struct vnt_usb_send_context *tx_context,
+			     union vnt_tx_data_head *head)
+{
+	struct vnt_private *priv = tx_context->priv;
+	struct vnt_cts *buf = &head->cts_g;
+	u32 cts_frame_len = 14;
+	u16 current_rate = tx_context->tx_rate;
+
+	/* Get SignalField,ServiceField,Length */
+	vnt_get_phy_field(priv, cts_frame_len, priv->top_cck_basic_rate,
+			  PK_TYPE_11B, &buf->b);
+	/* Get CTSDuration_ba */
+	buf->duration_ba =
+		vnt_get_rtscts_duration_le(tx_context, CTSDUR_BA,
+					   tx_context->pkt_type,
+					   current_rate);
+	/*Get CTS Frame body*/
+	buf->data.duration = buf->duration_ba;
+	buf->data.frame_control =
+		cpu_to_le16(IEEE80211_FTYPE_CTL | IEEE80211_STYPE_CTS);
+
+	ether_addr_copy(buf->data.ra, priv->current_net_addr);
+
+	return vnt_rxtx_datahead_g(tx_context, &buf->data_head);
 }
 
 static u16 vnt_rxtx_rts(struct vnt_usb_send_context *tx_context,
@@ -628,6 +634,9 @@ static u16 vnt_rxtx_cts(struct vnt_usb_send_context *tx_context,
 		head = &tx_head->tx_cts.tx.mic.head;
 
 	/* Fill CTS */
+	if (tx_context->fb_option)
+		return vnt_fill_cts_fb_head(tx_context, head);
+
 	return vnt_fill_cts_head(tx_context, head);
 }
 

commit 5c9b063a0ae48acaba69ebffc43ea8214ff70c64
Author: Malcolm Priestley <tvboxspy@gmail.com>
Date:   Sun Feb 1 11:59:42 2015 +0000

    staging: vt6656: vnt_fill_cts_head remove unneeded NULL check.
    
    union vnt_tx_data_head is nolonger detached from main
    vnt_tx_buffer structure so this check is unnecessary.
    
    Signed-off-by: Malcolm Priestley <tvboxspy@gmail.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

diff --git a/drivers/staging/vt6656/rxtx.c b/drivers/staging/vt6656/rxtx.c
index b74f672ff696..3b90497bc6e8 100644
--- a/drivers/staging/vt6656/rxtx.c
+++ b/drivers/staging/vt6656/rxtx.c
@@ -525,9 +525,6 @@ static u16 vnt_fill_cts_head(struct vnt_usb_send_context *tx_context,
 	u32 cts_frame_len = 14;
 	u16 current_rate = tx_context->tx_rate;
 
-	if (!head)
-		return 0;
-
 	if (tx_context->fb_option) {
 		/* Auto Fall back */
 		struct vnt_cts_fb *buf = &head->cts_g_fb;

commit 48eaa7f59649eb4d371ad5e75c606f65e80a93ad
Author: Heba Aamer <heba93aamer@gmail.com>
Date:   Wed Jan 21 13:08:48 2015 +0200

    staging: vt6656: fix Prefer ether_addr_copy() over memcpy() if the Ethernet addresses are __aligned(2)
    
    This patch fixes the following checkpatch.pl warning:
    fix Prefer ether_addr_copy() over memcpy()
    if the Ethernet addresses are __aligned(2)
    
    Pahole showed that the 2 structs are aligned to u16
    
    struct vnt_mic_hdr {
            u8                         id;                   /*     0     1 */
            u8                         tx_priority;          /*     1     1 */
            u8                         mic_addr2[6];         /*     2     6 */
            u8                         ccmp_pn[6];           /*     8     6 */
            __be16                     payload_len;          /*    14     2 */
            __be16                     hlen;                 /*    16     2 */
            __le16                     frame_control;        /*    18     2 */
            u8                         addr1[6];             /*    20     6 */
            u8                         addr2[6];             /*    26     6 */
            u8                         addr3[6];             /*    32     6 */
            __le16                     seq_ctrl;             /*    38     2 */
            u8                         addr4[6];             /*    40     6 */
            u16                        packing;              /*    46     2 */
    
            /* size: 48, cachelines: 1, members: 13 */
            /* last cacheline: 48 bytes */
    };
    
    struct ieee80211_hdr {
            __le16                     frame_control;        /*     0     2 */
            __le16                     duration_id;          /*     2     2 */
            u8                         addr1[6];             /*     4     6 */
            u8                         addr2[6];             /*    10     6 */
            u8                         addr3[6];             /*    16     6 */
            __le16                     seq_ctrl;             /*    22     2 */
            u8                         addr4[6];             /*    24     6 */
    
            /* size: 30, cachelines: 1, members: 7 */
            /* last cacheline: 30 bytes */
    };
    
    Signed-off-by: Heba Aamer <heba93aamer@gmail.com>
    Reviewed-by: Aya Mahfouz <mahfouz.saif.elyazal@gmail.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

diff --git a/drivers/staging/vt6656/rxtx.c b/drivers/staging/vt6656/rxtx.c
index bb6a4d43af58..b74f672ff696 100644
--- a/drivers/staging/vt6656/rxtx.c
+++ b/drivers/staging/vt6656/rxtx.c
@@ -738,7 +738,7 @@ static void vnt_fill_txkey(struct vnt_usb_send_context *tx_context,
 
 		mic_hdr->id = 0x59;
 		mic_hdr->payload_len = cpu_to_be16(payload_len);
-		memcpy(mic_hdr->mic_addr2, hdr->addr2, ETH_ALEN);
+		ether_addr_copy(mic_hdr->mic_addr2, hdr->addr2);
 
 		ieee80211_get_key_tx_seq(tx_key, &seq);
 

commit 09a7a6b5d8b026dd25b1e047e4920e4baa150105
Author: Emrys Bayliss <emrys@paradise.net.nz>
Date:   Tue Jan 13 03:51:36 2015 +1100

