commit b664312285eb6bb9378159f2fea02e39886a7012
Author: Rohit Sarkar <rohitsarkar5398@gmail.com>
Date:   Wed Oct 2 22:35:19 2019 +0530

    staging: rtl8712: fix boundary condition for n
    
    Now that snprintf is replaced by scnprintf n >= MAX_WPA_IE_LEN doesn't
    make sense as the maximum value n can take is MAX_WPA_IE_LEN.
    
    Signed-off-by: Rohit Sarkar <rohitsarkar5398@gmail.com>
    Reviewed-by: Dan Carpenter <dan.carpenter@oracle.com>
    Link: https://lore.kernel.org/r/20191002170518.GA1688@SARKAR
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

diff --git a/drivers/staging/rtl8712/rtl871x_ioctl_linux.c b/drivers/staging/rtl8712/rtl871x_ioctl_linux.c
index b3263e953f05..363b82e3e7c6 100644
--- a/drivers/staging/rtl8712/rtl871x_ioctl_linux.c
+++ b/drivers/staging/rtl8712/rtl871x_ioctl_linux.c
@@ -144,7 +144,7 @@ static noinline_for_stack char *translate_scan_wpa(struct iw_request_info *info,
 		for (i = 0; i < wpa_len; i++) {
 			n += scnprintf(buf + n, MAX_WPA_IE_LEN - n,
 						"%02x", wpa_ie[i]);
-			if (n >= MAX_WPA_IE_LEN)
+			if (n == MAX_WPA_IE_LEN-1)
 				break;
 		}
 		memset(iwe, 0, sizeof(*iwe));
@@ -164,7 +164,7 @@ static noinline_for_stack char *translate_scan_wpa(struct iw_request_info *info,
 		for (i = 0; i < rsn_len; i++) {
 			n += scnprintf(buf + n, MAX_WPA_IE_LEN - n,
 						"%02x", rsn_ie[i]);
-			if (n >= MAX_WPA_IE_LEN)
+			if (n == MAX_WPA_IE_LEN-1)
 				break;
 		}
 		memset(iwe, 0, sizeof(*iwe));


@@ -2155,7 +2155,7 @@ static int wpa_set_param(struct net_device *dev, u8 name, u32 value)
 
 static int wpa_mlme(struct net_device *dev, u32 command, u32 reason)
 {
-	struct _adapter *padapter = (struct _adapter *) netdev_priv(dev);
+	struct _adapter *padapter = netdev_priv(dev);
 
 	switch (command) {
 	case IEEE_MLME_STA_DEAUTH:
@@ -2176,7 +2176,7 @@ static int wpa_supplicant_ioctl(struct net_device *dev, struct iw_point *p)
 {
 	struct ieee_param *param;
 	int ret = 0;
-	struct _adapter *padapter = (struct _adapter *) netdev_priv(dev);
+	struct _adapter *padapter = netdev_priv(dev);
 
 	if (p->length < sizeof(struct ieee_param) || !p->pointer)
 		return -EINVAL;
@@ -2329,7 +2329,7 @@ static iw_handler r8711_private_handler[] = {
 
 static struct iw_statistics *r871x_get_wireless_stats(struct net_device *dev)
 {
-	struct _adapter *padapter = (struct _adapter *) netdev_priv(dev);
+	struct _adapter *padapter = netdev_priv(dev);
 	struct iw_statistics *piwstats = &padapter->iwstats;
 	int tmp_level = 0;
 	int tmp_qual = 0;

commit 45de432775d6df1b349b02c4d783237937278906
Author: Cristina Opriceana <cristina.opriceana@gmail.com>
Date:   Sat Mar 28 02:57:34 2015 +0200

    Staging: rtl8712: Use memdup_user() instead of copy_from_user()
    
    Use memdup_user() to avoid its duplicated implementation and simplify
    code. memdup_user() uses GFP_KERNEL instead of GFP_ATOMIC,
    which is valid because copy_from_user() might sleep and it's useless
    to make the allocation atomic. Found with coccinelle.
    
    Signed-off-by: Cristina Opriceana <cristina.opriceana@gmail.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

diff --git a/drivers/staging/rtl8712/rtl871x_ioctl_linux.c b/drivers/staging/rtl8712/rtl871x_ioctl_linux.c
index 81f39c315947..c39d031c4aa6 100644
--- a/drivers/staging/rtl8712/rtl871x_ioctl_linux.c
+++ b/drivers/staging/rtl8712/rtl871x_ioctl_linux.c
@@ -1912,13 +1912,9 @@ static int r871x_mp_ioctl_hdl(struct net_device *dev,
 	bset = (u8)(p->flags & 0xFFFF);
 	len = p->length;
 	pparmbuf = NULL;
-	pparmbuf = kmalloc(len, GFP_ATOMIC);
-	if (pparmbuf == NULL) {
-		ret = -ENOMEM;
-		goto _r871x_mp_ioctl_hdl_exit;
-	}
-	if (copy_from_user(pparmbuf, p->pointer, len)) {
-		ret = -EFAULT;
+	pparmbuf = memdup_user(p->pointer, len);
+	if (IS_ERR(pparmbuf)) {
+		ret = PTR_ERR(pparmbuf);
 		goto _r871x_mp_ioctl_hdl_exit;
 	}
 	poidparam = (struct mp_ioctl_param *)pparmbuf;

commit e0e982b436cd678dc80a1167a00a8104f54bb761
Author: Haneen Mohammed <hamohammed.sa@gmail.com>
Date:   Mon Mar 16 18:41:31 2015 +0300

    Staging: rtl8712: replace memcpy with ether_addr_copy
    
    This patch replace memcpy with ethe_addr_copy to address the following
    warning generated by checkpatch.pl: ""Prefer ether_addr_copy over memcpy
    if the Ethernet addresses are __aligned(2)"
    
    Follwoing is the output of pahole for the relevant datastructures:
    1- for  "iwe.u.ap_addr.sa_data" and "wrqu->ap_addr.sa_data"
    
    struct sockaddr {
            sa_family_t                sa_family;            /*     0     2 */
            char                       sa_data[14];          /*     2    14 */
    
            /* size: 16, cachelines: 1, members: 2 */
            /* last cacheline: 16 bytes */
    };
    
    struct iw_event {
            __u16                      len;                  /*     0     2 */
            __u16                      cmd;                  /*     2     2 */
    
            /* XXX 4 bytes hole, try to pack */
    
            union iwreq_data           u;                    /*     8    16 */
    
            /* size: 24, cachelines: 1, members: 3 */
            /* sum members: 20, holes: 1, sum holes: 4 */
            /* last cacheline: 24 bytes */
    };
    
    2- for  "pnetwork->network.MacAddress" and "pcur_bss->MacAddress"
    
    struct wlan_network {
            struct list_head           list;                 /*     0    16 */
            int                        network_type;         /*    16     4 */
            int                        fixed;                /*    20     4 */
            unsigned int               last_scanned;         /*    24     4 */
            int                        aid;                  /*    28     4 */
            int                        join_res;             /*    32     4 */
            struct ndis_wlan_bssid_ex  network;              /*    36   884 */
            /* --- cacheline 14 boundary (896 bytes) was 24 bytes ago ---   */
    
            /* size: 920, cachelines: 15, members: 7 */
            /* last cacheline: 24 bytes */
    };
    
    struct ndis_wlan_bssid_ex {
            u32                        Length;               /*     0     4 */
            unsigned char              MacAddress[6];        /*     4     6 */
            u8                         Reserved[2];          /*    10     2 */
            struct ndis_802_11_ssid    Ssid;                 /*    12    36 */
            u32                        Privacy;              /*    48     4 */
            s32                        Rssi;                 /*    52     4 */
            enum NDIS_802_11_NETWORK_TYPE NetworkTypeInUse;  /*    56     4 */
            struct NDIS_802_11_CONFIGURATION Configuration;  /*    60    32 */
            /* --- cacheline 1 boundary (64 bytes) was 28 bytes ago --- */
            enum NDIS_802_11_NETWORK_INFRASTRUCTURE InfrastructureMode; /* 92     4 */
            NDIS_802_11_RATES_EX       SupportedRates;       /*    96    16 */
            u32                        IELength;             /*   112     4 */
            u8                         IEs[768];             /*   116   768 */
            /* --- cacheline 13 boundary (832 bytes) was 52 bytes ago --- */
    
            /* size: 884, cachelines: 14, members: 12 */
            /* last cacheline: 52 bytes */
    };
    
    Signed-off-by: Haneen Mohammed <hamohammed.sa@gmail.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

diff --git a/drivers/staging/rtl8712/rtl871x_ioctl_linux.c b/drivers/staging/rtl8712/rtl871x_ioctl_linux.c
index eacba8c37cc1..81f39c315947 100644
--- a/drivers/staging/rtl8712/rtl871x_ioctl_linux.c
+++ b/drivers/staging/rtl8712/rtl871x_ioctl_linux.c
@@ -185,7 +185,7 @@ static inline char *translate_scan(struct _adapter *padapter,
 	/* AP MAC address */
 	iwe.cmd = SIOCGIWAP;
 	iwe.u.ap_addr.sa_family = ARPHRD_ETHER;
-	memcpy(iwe.u.ap_addr.sa_data, pnetwork->network.MacAddress, ETH_ALEN);
+	ether_addr_copy(iwe.u.ap_addr.sa_data, pnetwork->network.MacAddress);
 	start = iwe_stream_add_event(info, start, stop, &iwe, IW_EV_ADDR_LEN);
