commit 04c349a96506961b1b31e8d03e784fe3c5413e0b
Author: Maor Gottlieb <maorg@mellanox.com>
Date:   Mon Apr 13 16:24:08 2020 +0300

    RDMA/mad: Remove snoop interface
    
    Snoop interface is not used. Remove it.
    
    Link: https://lore.kernel.org/r/20200413132408.931084-1-leon@kernel.org
    Signed-off-by: Maor Gottlieb <maorg@mellanox.com>
    Signed-off-by: Leon Romanovsky <leonro@mellanox.com>
    Signed-off-by: Jason Gunthorpe <jgg@mellanox.com>

diff --git a/include/rdma/ib_mad.h b/include/rdma/ib_mad.h
index 4e62650e2127..8c093fc1bb9f 100644
--- a/include/rdma/ib_mad.h
+++ b/include/rdma/ib_mad.h
@@ -558,20 +558,6 @@ struct ib_mad_recv_wc;
 typedef void (*ib_mad_send_handler)(struct ib_mad_agent *mad_agent,
 				    struct ib_mad_send_wc *mad_send_wc);
 
-/**
- * ib_mad_snoop_handler - Callback handler for snooping sent MADs.
- * @mad_agent: MAD agent that snooped the MAD.
- * @send_buf: send MAD data buffer.
- * @mad_send_wc: Work completion information on the sent MAD.  Valid
- *   only for snooping that occurs on a send completion.
- *
- * Clients snooping MADs should not modify data referenced by the @send_buf
- * or @mad_send_wc.
- */
-typedef void (*ib_mad_snoop_handler)(struct ib_mad_agent *mad_agent,
-				     struct ib_mad_send_buf *send_buf,
-				     struct ib_mad_send_wc *mad_send_wc);
-
 /**
  * ib_mad_recv_handler - callback handler for a received MAD.
  * @mad_agent: MAD agent requesting the received MAD.

    Signed-off-by: Erez Alfasi <ereza@mellanox.com>
    Signed-off-by: Leon Romanovsky <leonro@mellanox.com>
    Signed-off-by: Jason Gunthorpe <jgg@mellanox.com>

diff --git a/include/rdma/ib_mad.h b/include/rdma/ib_mad.h
index 79ba8219e7dc..eea946fcc819 100644
--- a/include/rdma/ib_mad.h
+++ b/include/rdma/ib_mad.h
@@ -198,7 +198,7 @@ struct ib_sa_hdr {
 	__be16			attr_offset;
 	__be16			reserved;
 	ib_sa_comp_mask		comp_mask;
-} __attribute__ ((packed));
+} __packed;
 
 struct ib_mad {
 	struct ib_mad_hdr	mad_hdr;
@@ -227,7 +227,7 @@ struct ib_sa_mad {
 	struct ib_rmpp_hdr	rmpp_hdr;
 	struct ib_sa_hdr	sa_hdr;
 	u8			data[IB_MGMT_SA_DATA];
-} __attribute__ ((packed));
+} __packed;
 
 struct ib_vendor_mad {
 	struct ib_mad_hdr	mad_hdr;

commit c66f67414c1f88554485bb2a0abf8b5c0d741de7
Author: Daniel Jurgens <danielj@mellanox.com>
Date:   Sat Feb 2 11:09:45 2019 +0200

    IB/core: Don't register each MAD agent for LSM notifier
    
    When creating many MAD agents in a short period of time, receive packet
    processing can be delayed long enough to cause timeouts while new agents
    are being added to the atomic notifier chain with IRQs disabled.  Notifier
    chain registration and unregstration is an O(n) operation. With large
    numbers of MAD agents being created and destroyed simultaneously the CPUs
    spend too much time with interrupts disabled.
    
    Instead of each MAD agent registering for it's own LSM notification,
    maintain a list of agents internally and register once, this registration
    already existed for handling the PKeys. This list is write mostly, so a
    normal spin lock is used vs a read/write lock. All MAD agents must be
    checked, so a single list is used instead of breaking them down per
    device.
    
    Notifier calls are done under rcu_read_lock, so there isn't a risk of
    similar packet timeouts while checking the MAD agents security settings
    when notified.
    
    Signed-off-by: Daniel Jurgens <danielj@mellanox.com>
    Reviewed-by: Parav Pandit <parav@mellanox.com>
    Signed-off-by: Leon Romanovsky <leonro@mellanox.com>
    Acked-by: Paul Moore <paul@paul-moore.com>
    Signed-off-by: Jason Gunthorpe <jgg@mellanox.com>

diff --git a/include/rdma/ib_mad.h b/include/rdma/ib_mad.h
index 1c0b914f199d..79ba8219e7dc 100644
--- a/include/rdma/ib_mad.h
+++ b/include/rdma/ib_mad.h
@@ -617,11 +617,10 @@ struct ib_mad_agent {
 	u32			hi_tid;
 	u32			flags;
 	void			*security;
-	struct notifier_block   lsm_nb;
+	struct list_head	mad_agent_sec_list;
 	u8			port_num;
 	u8			rmpp_version;
 	bool			smp_allowed;
-	bool			lsm_nb_reg;
 };
 
 /**

commit 805b754d492f6227e1646001bdf85ad4bb819e55
Author: Daniel Jurgens <danielj@mellanox.com>
Date:   Sat Feb 2 11:09:44 2019 +0200

    IB/core: Eliminate a hole in MAD agent struct
    
    Move the security related fields above the u8s to eliminate a hole in the
    struct.
    
    pahole before:
    struct ib_mad_agent {
    ...
    u32                        hi_tid;               /*    48     4 */
    u32                        flags;                /*    52     4 */
    u8                         port_num;             /*    56     1 */
    u8                         rmpp_version;         /*    57     1 */
    
    /* XXX 6 bytes hole, try to pack */
    
    /* --- cacheline 1 boundary (64 bytes) --- */
    void *                     security;             /*    64     8 */
    bool                       smp_allowed;          /*    72     1 */
    bool                       lsm_nb_reg;           /*    73     1 */
    
    /* XXX 6 bytes hole, try to pack */
    
    struct notifier_block      lsm_nb;               /*    80    24 */
    
    /* XXX last struct has 4 bytes of padding */
    
    /* size: 104, cachelines: 2, members: 14 */
    ...
    };
    
    pahole after:
    struct ib_mad_agent {
    ...
    u32                        hi_tid;               /*    48     4 */
    u32                        flags;                /*    52     4 */
    void *                     security;             /*    56     8 */
    /* --- cacheline 1 boundary (64 bytes) --- */
    struct notifier_block      lsm_nb;               /*    64    24 */
    
    /* XXX last struct has 4 bytes of padding */
    
    u8                         port_num;             /*    88     1 */
    u8                         rmpp_version;         /*    89     1 */
    bool                       smp_allowed;          /*    90     1 */
    bool                       lsm_nb_reg;           /*    91     1 */
    
    /* size: 96, cachelines: 2, members: 14 */
    ...
    };
    
    Signed-off-by: Daniel Jurgens <danielj@mellanox.com>
    Reviewed-by: Parav Pandit <parav@mellanox.com>
    Signed-off-by: Leon Romanovsky <leonro@mellanox.com>
    Signed-off-by: Jason Gunthorpe <jgg@mellanox.com>

diff --git a/include/rdma/ib_mad.h b/include/rdma/ib_mad.h
index fdef558e3a2d..1c0b914f199d 100644
--- a/include/rdma/ib_mad.h
+++ b/include/rdma/ib_mad.h
@@ -616,12 +616,12 @@ struct ib_mad_agent {
 	void			*context;
 	u32			hi_tid;
 	u32			flags;
+	void			*security;
+	struct notifier_block   lsm_nb;
 	u8			port_num;
 	u8			rmpp_version;
-	void			*security;
 	bool			smp_allowed;
 	bool			lsm_nb_reg;
-	struct notifier_block   lsm_nb;
 };
 
 /**

commit 1e8f43b7fb25aa7a85db1e81b4689dd394e23b35
Author: Michael Guralnik <michaelgur@mellanox.com>
Date:   Sun Dec 9 11:49:48 2018 +0200

    IB/core: Add CapabilityMask2 to port attributes
    
