commit bcc7f554cfa7e0ac77c7adc4027c16f4a2f99c6f
Author: Quentin Monnet <quentin@isovalent.com>
Date:   Tue Jun 23 16:39:35 2020 +0100

    bpf: Fix formatting in documentation for BPF helpers
    
    When producing the bpf-helpers.7 man page from the documentation from
    the BPF user space header file, rst2man complains:
    
        <stdin>:2636: (ERROR/3) Unexpected indentation.
        <stdin>:2640: (WARNING/2) Block quote ends without a blank line; unexpected unindent.
    
    Let's fix formatting for the relevant chunk (item list in
    bpf_ringbuf_query()'s description), and for a couple other functions.
    
    Signed-off-by: Quentin Monnet <quentin@isovalent.com>
    Signed-off-by: Alexei Starovoitov <ast@kernel.org>
    Acked-by: Andrii Nakryiko <andriin@fb.com>
    Link: https://lore.kernel.org/bpf/20200623153935.6215-1-quentin@isovalent.com

diff --git a/include/uapi/linux/bpf.h b/include/uapi/linux/bpf.h
index 974a71342aea..8bd33050b7bb 100644
--- a/include/uapi/linux/bpf.h
+++ b/include/uapi/linux/bpf.h
@@ -3171,13 +3171,12 @@ union bpf_attr {
  * int bpf_ringbuf_output(void *ringbuf, void *data, u64 size, u64 flags)
  * 	Description
  * 		Copy *size* bytes from *data* into a ring buffer *ringbuf*.
- * 		If BPF_RB_NO_WAKEUP is specified in *flags*, no notification of
- * 		new data availability is sent.
- * 		IF BPF_RB_FORCE_WAKEUP is specified in *flags*, notification of
- * 		new data availability is sent unconditionally.

 		/* output: metric of fib result (IPv4/IPv6 only) */
 		__u32	rt_metric;

commit bf6fa2c893c5237b48569a13fa3c673041430b6c
Author: Yonghong Song <yhs@fb.com>
Date:   Sun Jun 3 15:59:41 2018 -0700

    bpf: implement bpf_get_current_cgroup_id() helper
    
    bpf has been used extensively for tracing. For example, bcc
    contains an almost full set of bpf-based tools to trace kernel
    and user functions/events. Most tracing tools are currently
    either filtered based on pid or system-wide.
    
    Containers have been used quite extensively in industry and
    cgroup is often used together to provide resource isolation
    and protection. Several processes may run inside the same
    container. It is often desirable to get container-level tracing
    results as well, e.g. syscall count, function count, I/O
    activity, etc.
    
    This patch implements a new helper, bpf_get_current_cgroup_id(),
    which will return cgroup id based on the cgroup within which
    the current task is running.
    
    The later patch will provide an example to show that
    userspace can get the same cgroup id so it could
    configure a filter or policy in the bpf program based on
    task cgroup id.
    
    The helper is currently implemented for tracing. It can
    be added to other program types as well when needed.
    
    Acked-by: Alexei Starovoitov <ast@kernel.org>
    Signed-off-by: Yonghong Song <yhs@fb.com>
    Signed-off-by: Alexei Starovoitov <ast@kernel.org>

diff --git a/include/uapi/linux/bpf.h b/include/uapi/linux/bpf.h
index f0b6608b1f1c..18712b0dbfe7 100644
--- a/include/uapi/linux/bpf.h
+++ b/include/uapi/linux/bpf.h
@@ -2070,6 +2070,11 @@ union bpf_attr {
  * 		**CONFIG_SOCK_CGROUP_DATA** configuration option.
  * 	Return
  * 		The id is returned or 0 in case the id could not be retrieved.
+ *
+ * u64 bpf_get_current_cgroup_id(void)
+ * 	Return
+ * 		A 64-bit integer containing the current cgroup id based
+ * 		on the cgroup within which the current task is running.
  */
 #define __BPF_FUNC_MAPPER(FN)		\
 	FN(unspec),			\
@@ -2151,7 +2156,8 @@ union bpf_attr {
 	FN(lwt_seg6_action),		\
 	FN(rc_repeat),			\
 	FN(rc_keydown),			\
-	FN(skb_cgroup_id),
+	FN(skb_cgroup_id),		\
+	FN(get_current_cgroup_id),
 
 /* integer value in 'imm' field of BPF_CALL instruction selects which helper
  * function eBPF program intends to call

commit 1fbc2e0cfcf9677683aea2b1f9ea76fbdc6fb6d1
Author: Daniel Borkmann <daniel@iogearbox.net>
Date:   Sat Jun 2 23:06:37 2018 +0200

    bpf: make sure to clear unused fields in tunnel/xfrm state fetch
    
    Since the remaining bits are not filled in struct bpf_tunnel_key
    resp. struct bpf_xfrm_state and originate from uninitialized stack
    space, we should make sure to clear them before handing control
    back to the program.
    
    Also add a padding element to struct bpf_xfrm_state for future use
    similar as we have in struct bpf_tunnel_key and clear it as well.
    
      struct bpf_xfrm_state {
          __u32                      reqid;            /*     0     4 */
          __u32                      spi;              /*     4     4 */
          __u16                      family;           /*     8     2 */
    
          /* XXX 2 bytes hole, try to pack */
    
          union {
              __u32              remote_ipv4;          /*           4 */
              __u32              remote_ipv6[4];       /*          16 */
          };                                           /*    12    16 */
    
          /* size: 28, cachelines: 1, members: 4 */
          /* sum members: 26, holes: 1, sum holes: 2 */
          /* last cacheline: 28 bytes */
      };
    
    Signed-off-by: Daniel Borkmann <daniel@iogearbox.net>
    Acked-by: Alexei Starovoitov <ast@kernel.org>
    Acked-by: Song Liu <songliubraving@fb.com>
    Signed-off-by: Alexei Starovoitov <ast@kernel.org>

diff --git a/include/uapi/linux/bpf.h b/include/uapi/linux/bpf.h
index 661318141f72..f0b6608b1f1c 100644
--- a/include/uapi/linux/bpf.h
+++ b/include/uapi/linux/bpf.h
@@ -2268,7 +2268,7 @@ struct bpf_tunnel_key {
 	};
 	__u8 tunnel_tos;
 	__u8 tunnel_ttl;
-	__u16 tunnel_ext;
+	__u16 tunnel_ext;	/* Padding, future use. */
 	__u32 tunnel_label;
 };
 
@@ -2279,6 +2279,7 @@ struct bpf_xfrm_state {
 	__u32 reqid;
 	__u32 spi;	/* Stored in network byte order */
 	__u16 family;
+	__u16 ext;	/* Padding, future use. */
 	union {
 		__u32 remote_ipv4;	/* Stored in network byte order */
 		__u32 remote_ipv6[4];	/* Stored in network byte order */

commit cb20b08ead401fd17627a36f035c0bf5bfee5567
Author: Daniel Borkmann <daniel@iogearbox.net>
Date:   Sat Jun 2 23:06:36 2018 +0200

    bpf: add bpf_skb_cgroup_id helper
    
    Add a new bpf_skb_cgroup_id() helper that allows to retrieve the
    cgroup id from the skb's socket. This is useful in particular to
    enable bpf_get_cgroup_classid()-like behavior for cgroup v1 in
    cgroup v2 by allowing ID based matching on egress. This can in
    particular be used in combination with applying policy e.g. from
    map lookups, and also complements the older bpf_skb_under_cgroup()
    interface. In user space the cgroup id for a given path can be
    retrieved through the f_handle as demonstrated in [0] recently.
    
      [0] https://lkml.org/lkml/2018/5/22/1190
    
    Signed-off-by: Daniel Borkmann <daniel@iogearbox.net>
    Acked-by: Alexei Starovoitov <ast@kernel.org>
    Signed-off-by: Alexei Starovoitov <ast@kernel.org>

diff --git a/include/uapi/linux/bpf.h b/include/uapi/linux/bpf.h
index 64ac0f7a689e..661318141f72 100644
--- a/include/uapi/linux/bpf.h
+++ b/include/uapi/linux/bpf.h
@@ -2054,6 +2054,22 @@ union bpf_attr {
  *
  *	Return
  *		0
+ *
+ * uint64_t bpf_skb_cgroup_id(struct sk_buff *skb)
+ * 	Description
+ * 		Return the cgroup v2 id of the socket associated with the *skb*.
+ * 		This is roughly similar to the **bpf_get_cgroup_classid**\ ()
+ * 		helper for cgroup v1 by providing a tag resp. identifier that
+ * 		can be matched on or used for map lookups e.g. to implement
+ * 		policy. The cgroup v2 id of a given path in the hierarchy is
+ * 		exposed in user space through the f_handle API in order to get
+ * 		to the same 64-bit id.
+ *
+ * 		This helper can be used on TC egress path, but not on ingress,
+ * 		and is available only if the kernel was compiled with the
+ * 		**CONFIG_SOCK_CGROUP_DATA** configuration option.
+ * 	Return
+ * 		The id is returned or 0 in case the id could not be retrieved.
  */
 #define __BPF_FUNC_MAPPER(FN)		\
 	FN(unspec),			\
@@ -2134,7 +2150,8 @@ union bpf_attr {
 	FN(lwt_seg6_adjust_srh),	\
 	FN(lwt_seg6_action),		\
 	FN(rc_repeat),			\
-	FN(rc_keydown),
+	FN(rc_keydown),			\
+	FN(skb_cgroup_id),
 
 /* integer value in 'imm' field of BPF_CALL instruction selects which helper
  * function eBPF program intends to call

commit 9c54aeb03a6d65a5834bd92376e921cbac6dfb8f
Merge: eaf47b17a77f 918fe1b31579
Author: David S. Miller <davem@davemloft.net>
Date:   Sun Jun 3 09:31:58 2018 -0400

    Merge git://git.kernel.org/pub/scm/linux/kernel/git/davem/net
    
    Filling in the padding slot in the bpf structure as a bug fix in 'ne'
    overlapped with actually using that padding area for something in
    'net-next'.
    
    Signed-off-by: David S. Miller <davem@davemloft.net>

commit 36f9814a494a874d5a0f44843544b4b2539022db
Author: Daniel Borkmann <daniel@iogearbox.net>
Date:   Sat Jun 2 05:21:59 2018 +0200

    bpf: fix uapi hole for 32 bit compat applications
    
    In 64 bit, we have a 4 byte hole between ifindex and netns_dev in the
    case of struct bpf_map_info but also struct bpf_prog_info. In net-next
    commit b85fab0e67b ("bpf: Add gpl_compatible flag to struct bpf_prog_info")
    added a bitfield into it to expose some flags related to programs. Thus,
    add an unnamed __u32 bitfield for both so that alignment keeps the same
    in both 32 and 64 bit cases, and can be naturally extended from there
    as in b85fab0e67b.
    
    Before:
    
      # file test.o
      test.o: ELF 32-bit LSB relocatable, Intel 80386, version 1 (SYSV), not stripped
      # pahole test.o
      struct bpf_map_info {
            __u32                      type;                 /*     0     4 */
            __u32                      id;                   /*     4     4 */
            __u32                      key_size;             /*     8     4 */
            __u32                      value_size;           /*    12     4 */
            __u32                      max_entries;          /*    16     4 */
            __u32                      map_flags;            /*    20     4 */
            char                       name[16];             /*    24    16 */
            __u32                      ifindex;              /*    40     4 */
            __u64                      netns_dev;            /*    44     8 */
            __u64                      netns_ino;            /*    52     8 */
    
            /* size: 64, cachelines: 1, members: 10 */
            /* padding: 4 */
      };
    
    After (same as on 64 bit):
    
      # file test.o
      test.o: ELF 32-bit LSB relocatable, Intel 80386, version 1 (SYSV), not stripped
      # pahole test.o
      struct bpf_map_info {
            __u32                      type;                 /*     0     4 */
            __u32                      id;                   /*     4     4 */
            __u32                      key_size;             /*     8     4 */
            __u32                      value_size;           /*    12     4 */
            __u32                      max_entries;          /*    16     4 */
            __u32                      map_flags;            /*    20     4 */
            char                       name[16];             /*    24    16 */
            __u32                      ifindex;              /*    40     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            __u64                      netns_dev;            /*    48     8 */
            __u64                      netns_ino;            /*    56     8 */
            /* --- cacheline 1 boundary (64 bytes) --- */
    
            /* size: 64, cachelines: 1, members: 10 */
            /* sum members: 60, holes: 1, sum holes: 4 */
      };
    
    Reported-by: Dmitry V. Levin <ldv@altlinux.org>
    Reported-by: Eugene Syromiatnikov <esyr@redhat.com>
    Fixes: 52775b33bb507 ("bpf: offload: report device information about offloaded maps")
    Fixes: 675fc275a3a2d ("bpf: offload: report device information for offloaded programs")
    Signed-off-by: Daniel Borkmann <daniel@iogearbox.net>
    Acked-by: Alexei Starovoitov <ast@kernel.org>
    Signed-off-by: Alexei Starovoitov <ast@kernel.org>

diff --git a/include/uapi/linux/bpf.h b/include/uapi/linux/bpf.h
index c5ec89732a8d..8c317737ba3f 100644
--- a/include/uapi/linux/bpf.h
+++ b/include/uapi/linux/bpf.h
@@ -1017,6 +1017,7 @@ struct bpf_prog_info {
 	__aligned_u64 map_ids;
 	char name[BPF_OBJ_NAME_LEN];
 	__u32 ifindex;
+	__u32 :32;
 	__u64 netns_dev;
