commit 097350d1c6e1f5808cae142006f18a0bbc57018d
Author: Steven Rostedt (VMware) <rostedt@goodmis.org>
Date:   Mon Jun 22 15:18:15 2020 -0400

    ring-buffer: Zero out time extend if it is nested and not absolute
    
    Currently the ring buffer makes events that happen in interrupts that preempt
    another event have a delta of zero. (Hopefully we can change this soon). But
    this is to deal with the races of updating a global counter with lockless
    and nesting functions updating deltas.
    
    With the addition of absolute time stamps, the time extend didn't follow
    this rule. A time extend can happen if two events happen longer than 2^27
    nanoseconds appart, as the delta time field in each event is only 27 bits.
    If that happens, then a time extend is injected with 2^59 bits of
    nanoseconds to use (18 years). But if the 2^27 nanoseconds happen between
    two events, and as it is writing the event, an interrupt triggers, it will
    see the 2^27 difference as well and inject a time extend of its own. But a
    recent change made the time extend logic not take into account the nesting,
    and this can cause two time extend deltas to happen moving the time stamp
    much further ahead than the current time. This gets all reset when the ring
    buffer moves to the next page, but that can cause time to appear to go
    backwards.
    
    This was observed in a trace-cmd recording, and since the data is saved in a

Date:   Fri Feb 13 10:25:18 2009 +0100

    Merge branches 'tracing/ftrace', 'tracing/ring-buffer', 'tracing/sysprof', 'tracing/urgent' and 'linus' into tracing/core

commit 45141d4667d208421ca787a3301542b6a5e0b112
Author: Steven Rostedt <srostedt@redhat.com>
Date:   Thu Feb 12 13:19:48 2009 -0500

    ring-buffer: rename label out_unlock to out_reset
    
    Impact: clean up
    
    While reviewing the ring buffer code, I thougth I saw a bug with
    
            if (!__raw_spin_trylock(&cpu_buffer->lock))
                    goto out_unlock;
    
    But I forgot that we use a variable "lock_taken" that is set if
    the spinlock is taken, and only unlock it if that variable is set.
    
    To avoid further confusion from other reviewers, this patch
    renames the label out_unlock with out_reset, which is the more
    appropriate name.
    
    Signed-off-by: Steven Rostedt <srostedt@redhat.com>

diff --git a/kernel/trace/ring_buffer.c b/kernel/trace/ring_buffer.c
index dc18b5b9ccb4..f39d7e9a4305 100644
--- a/kernel/trace/ring_buffer.c
+++ b/kernel/trace/ring_buffer.c
@@ -1017,7 +1017,7 @@ __rb_reserve_next(struct ring_buffer_per_cpu *cpu_buffer,
 		 */
 		if (unlikely(in_nmi())) {
 			if (!__raw_spin_trylock(&cpu_buffer->lock))
-				goto out_unlock;
+				goto out_reset;
 		} else
 			__raw_spin_lock(&cpu_buffer->lock);
 
@@ -1030,7 +1030,7 @@ __rb_reserve_next(struct ring_buffer_per_cpu *cpu_buffer,
 
 		/* we grabbed the lock before incrementing */
 		if (RB_WARN_ON(cpu_buffer, next_page == reader_page))
-			goto out_unlock;
+			goto out_reset;
 
 		/*
 		 * If for some reason, we had an interrupt storm that made
@@ -1039,12 +1039,12 @@ __rb_reserve_next(struct ring_buffer_per_cpu *cpu_buffer,
 		 */
 		if (unlikely(next_page == commit_page)) {
 			WARN_ON_ONCE(1);
-			goto out_unlock;
+			goto out_reset;
 		}
 
 		if (next_page == head_page) {
 			if (!(buffer->flags & RB_FL_OVERWRITE))
-				goto out_unlock;
+				goto out_reset;
 
 			/* tail_page has not moved yet? */
 			if (tail_page == cpu_buffer->tail_page) {
@@ -1118,7 +1118,7 @@ __rb_reserve_next(struct ring_buffer_per_cpu *cpu_buffer,
 
 	return event;
 
- out_unlock:
+ out_reset:
 	/* reset write */
 	if (tail <= BUF_PAGE_SIZE)
 		local_set(&tail_page->write, tail);

commit 00f62f614bb713027b9296068d1879fbca511eb7
Author: Arnaldo Carvalho de Melo <acme@redhat.com>
Date:   Mon Feb 9 17:04:06 2009 -0200

    ring_buffer: pahole struct ring_buffer
    
    While fixing some bugs in pahole (built-in.o files were not being
    processed due to relocation problems) I found out about these packable
    structures:
    
    $ pahole --packable kernel/trace/ring_buffer.o  | grep ring
    ring_buffer     72      64      8
    ring_buffer_per_cpu     112     104     8
    
    If we take a look at the current layout of struct ring_buffer we can see
    that we have two 4 bytes holes.
    
    $ pahole -C ring_buffer kernel/trace/ring_buffer.o
    struct ring_buffer {
            unsigned int               pages;           /*     0     4 */
            unsigned int               flags;           /*     4     4 */
            int                        cpus;            /*     8     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            cpumask_var_t              cpumask;         /*    16     8 */
            atomic_t                   record_disabled; /*    24     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            struct mutex               mutex;           /*    32    32 */
            /* --- cacheline 1 boundary (64 bytes) --- */
            struct ring_buffer_per_cpu * * buffers;     /*    64     8 */
    
            /* size: 72, cachelines: 2, members: 7 */
            /* sum members: 64, holes: 2, sum holes: 8 */
            /* last cacheline: 8 bytes */
    };
    
    So, if I ask pahole to reorganize it:
    
    $ pahole -C ring_buffer --reorganize kernel/trace/ring_buffer.o
    
    struct ring_buffer {
            unsigned int               pages;           /*     0     4 */
            unsigned int               flags;           /*     4     4 */
            int                        cpus;            /*     8     4 */
            atomic_t                   record_disabled; /*    12     4 */
            cpumask_var_t              cpumask;         /*    16     8 */
            struct mutex               mutex;           /*    24    32 */
            struct ring_buffer_per_cpu * * buffers;     /*    56     8 */
            /* --- cacheline 1 boundary (64 bytes) --- */
    
            /* size: 64, cachelines: 1, members: 7 */
    };   /* saved 8 bytes and 1 cacheline! */
    
    We get it using just one 64 bytes cacheline.
    
    To see what it did:
    
    $ pahole -C ring_buffer --reorganize --show_reorg_steps \
            kernel/trace/ring_buffer.o | grep \/
    /* Moving 'record_disabled' from after 'cpumask' to after 'cpus' */
    
    Signed-off-by: Arnaldo Carvalho de Melo <acme@redhat.com>
    Signed-off-by: Ingo Molnar <mingo@elte.hu>

diff --git a/kernel/trace/ring_buffer.c b/kernel/trace/ring_buffer.c
index 53ba3a6d16d0..27ef3bf13ed2 100644
--- a/kernel/trace/ring_buffer.c
+++ b/kernel/trace/ring_buffer.c
@@ -273,8 +273,8 @@ struct ring_buffer {
 	unsigned			pages;
 	unsigned			flags;
 	int				cpus;
-	cpumask_var_t			cpumask;
 	atomic_t			record_disabled;
+	cpumask_var_t			cpumask;
 
 	struct mutex			mutex;
 

