commit 2e7aaaa19cf226944c19fbefbbbbd76f9720b310
Author: Gustavo A. R. Silva <gustavo@embeddedor.com>
Date:   Fri Feb 28 18:13:05 2020 -0600

    net: sctp: Replace zero-length array with flexible-array member
    
    The current codebase makes use of the zero-length array language
    extension to the C90 standard, but the preferred mechanism to declare
    variable-length types such as these ones is a flexible array member[1][2],
    introduced in C99:
    
    struct foo {
            int stuff;
            struct boo array[];
    };
    
    By making use of the mechanism above, we will get a compiler warning
    in case the flexible array does not occur last in the structure, which
    will help us prevent some kind of undefined behavior bugs from being
    inadvertently introduced[3] to the codebase from now on.
    
    Also, notice that, dynamic memory allocations won't be affected by
    this change:
    
    "Flexible array members have incomplete type, and so the sizeof operator
    may not be applied. As a quirk of the original implementation of
    zero-length arrays, sizeof evaluates to zero."[1]
    
    This issue was found with the help of Coccinelle.
    
    [1] https://gcc.gnu.org/onlinedocs/gcc/Zero-Length.html
    [2] https://github.com/KSPP/linux/issues/21
    [3] commit 76497732932f ("cxgb3/l2t: Fix undefined behaviour")
    
    Signed-off-by: Gustavo A. R. Silva <gustavo@embeddedor.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>


    With the restructuring of the lksctp.org site, we only allow bug
    reports through the SCTP mailing list linux-sctp@vger.kernel.org,
    not via SF, as SF is only used for web hosting and nothing more.
    While at it, also remove the obvious statement that bugs will be
    fixed and incooperated into the kernel.
    
    Signed-off-by: Daniel Borkmann <dborkman@redhat.com>
    Acked-by: Vlad Yasevich <vyasevich@gmail.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/net/sctp/structs.h b/include/net/sctp/structs.h
index 06ebeaaaa9aa..78eedf0cd4b3 100644
--- a/include/net/sctp/structs.h
+++ b/include/net/sctp/structs.h
@@ -27,9 +27,6 @@
  * email addresses:
  *    lksctp developers <linux-sctp@vger.kernel.org>
  *
- * Or submit a bug report through the following website:
- *    http://www.sf.net/projects/lksctp
- *
  * Written or modified by:
  *    Randall Stewart	    <randall@sctp.chicago.il.us>
  *    Ken Morneau	    <kmorneau@cisco.com>
@@ -46,9 +43,6 @@
  *    Ryan Layer	    <rmlayer@us.ibm.com>
  *    Anup Pemmaiah	    <pemmaiah@cc.usu.edu>
  *    Kevin Gao             <kevin.gao@intel.com>
- *
- * Any bugs reported given to us we will try to fix... any fixes shared will
- * be incorporated into the next SCTP release.
  */
 
 #ifndef __sctp_structs_h__

commit cda5f98e36576596b9230483ec52bff3cc97eb21
Author: Daniel Borkmann <dborkman@redhat.com>
Date:   Tue Aug 6 21:18:12 2013 +0200

    net: sctp: convert sctp_checksum_disable module param into sctp sysctl
    
    Get rid of the last module parameter for SCTP and make this
    configurable via sysctl for SCTP like all the rest of SCTP's
    configuration knobs.
    
    Signed-off-by: Daniel Borkmann <dborkman@redhat.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/net/sctp/structs.h b/include/net/sctp/structs.h
index d9c93a77b1a9..06ebeaaaa9aa 100644
--- a/include/net/sctp/structs.h
+++ b/include/net/sctp/structs.h
@@ -141,10 +141,6 @@ extern struct sctp_globals {
 	/* This is the sctp port control hash.	*/
 	int port_hashsize;
 	struct sctp_bind_hashbucket *port_hashtable;
-
-	/* Flag to indicate whether computing and verifying checksum
-	 * is disabled. */
-        bool checksum_disable;
 } sctp_globals;
 
 #define sctp_max_instreams		(sctp_globals.max_instreams)
@@ -156,7 +152,6 @@ extern struct sctp_globals {
 #define sctp_assoc_hashtable		(sctp_globals.assoc_hashtable)
 #define sctp_port_hashsize		(sctp_globals.port_hashsize)
 #define sctp_port_hashtable		(sctp_globals.port_hashtable)
-#define sctp_checksum_disable		(sctp_globals.checksum_disable)
 
 /* SCTP Socket type: UDP or TCP style. */
 typedef enum {

commit 5a139296f872d438f17f7219411321b603c1622b
Author: fan.du <fan.du@windriver.com>
Date:   Mon Aug 5 17:13:03 2013 +0800

    sctp: Pack dst_cookie into 1st cacheline hole for 64bit host
    
    As dst_cookie is used in fast path sctp_transport_dst_check.
    
    Before:
    struct sctp_transport {
            struct list_head           transports;           /*     0    16 */
            atomic_t                   refcnt;               /*    16     4 */
            __u32                      dead:1;               /*    20:31  4 */
            __u32                      rto_pending:1;        /*    20:30  4 */
            __u32                      hb_sent:1;            /*    20:29  4 */
            __u32                      pmtu_pending:1;       /*    20:28  4 */
    
            /* XXX 28 bits hole, try to pack */
    
            __u32                      sack_generation;      /*    24     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            struct flowi               fl;                   /*    32    64 */
            /* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
            union sctp_addr            ipaddr;               /*    96    28 */
    
    After:
    struct sctp_transport {
            struct list_head           transports;           /*     0    16 */
            atomic_t                   refcnt;               /*    16     4 */
            __u32                      dead:1;               /*    20:31  4 */
            __u32                      rto_pending:1;        /*    20:30  4 */
            __u32                      hb_sent:1;            /*    20:29  4 */
            __u32                      pmtu_pending:1;       /*    20:28  4 */
    
            /* XXX 28 bits hole, try to pack */
    
            __u32                      sack_generation;      /*    24     4 */
            u32                        dst_cookie;           /*    28     4 */
            struct flowi               fl;                   /*    32    64 */
            /* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
            union sctp_addr            ipaddr;               /*    96    28 */
    
    Signed-off-by: Fan Du <fan.du@windriver.com>
    Acked-by: Neil Horman <nhorman@tuxdriver.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/net/sctp/structs.h b/include/net/sctp/structs.h
index c0f4e29eedd5..d9c93a77b1a9 100644
--- a/include/net/sctp/structs.h
+++ b/include/net/sctp/structs.h
@@ -782,6 +782,7 @@ struct sctp_transport {
 
 	/* Has this transport moved the ctsn since we last sacked */
 	__u32 sack_generation;
+	u32 dst_cookie;
 
 	struct flowi fl;
 
@@ -946,7 +947,6 @@ struct sctp_transport {
 	__u64 hb_nonce;
 
 	struct rcu_head rcu;
-	u32 dst_cookie;
 };
 
 struct sctp_transport *sctp_transport_new(struct net *, const union sctp_addr *,

commit d27fc78208b53ccdfd6a57d4ac44a459ca66806f
Author: fan.du <fan.du@windriver.com>
Date:   Fri Aug 2 10:45:13 2013 +0800

    sctp: Don't lookup dst if transport dst is still valid
    
