commit 6761893eeaa378321198f06194ef2e1e4e8a4ad4
Author: Paolo Abeni <pabeni@redhat.com>
Date:   Thu Jun 4 18:55:45 2020 +0200

    inet_connection_sock: clear inet_num out of destroy helper
    
    Clearing the 'inet_num' field is necessary and safe if and
    only if the socket is not bound. The MPTCP protocol calls
    the destroy helper on bound sockets, as tcp_v{4,6}_syn_recv_sock
    completed successfully.
    
    Move the clearing of such field out of the common code, otherwise
    the MPTCP MP_JOIN error path will find the wrong 'inet_num' value
    on socket disposal, __inet_put_port() will acquire the wrong lock
    and bind_node removal could race with other modifiers possibly
    corrupting the bind hash table.
    
    Reported-and-tested-by: Christoph Paasch <cpaasch@apple.com>
    Fixes: 729cd6436f35 ("mptcp: cope better with MP_JOIN failure")
    Signed-off-by: Paolo Abeni <pabeni@redhat.com>
    Reviewed-by: Eric Dumazet <edumazet@google.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/net/inet_connection_sock.h b/include/net/inet_connection_sock.h
index 2f1f8c3efb26..e5b388f5fa20 100644
--- a/include/net/inet_connection_sock.h
+++ b/include/net/inet_connection_sock.h
@@ -292,7 +292,6 @@ static inline void inet_csk_prepare_for_destroy_sock(struct sock *sk)
 	/* The below has to be done to allow calling inet_csk_destroy_sock */
 	sock_set_flag(sk, SOCK_DEAD);
 	percpu_counter_inc(sk->sk_prot->orphan_count);

 /** inet_connection_sock - INET connection oriented sock
@@ -244,10 +245,7 @@ extern struct request_sock *inet_csk_search_req(const struct sock *sk,
 						const __be32 laddr);
 extern int inet_csk_bind_conflict(const struct sock *sk,
 				  const struct inet_bind_bucket *tb);
-extern int inet_csk_get_port(struct inet_hashinfo *hashinfo,
-			     struct sock *sk, unsigned short snum,
-			     int (*bind_conflict)(const struct sock *sk,
-						  const struct inet_bind_bucket *tb));
+extern int inet_csk_get_port(struct sock *sk, unsigned short snum);
 
 extern struct dst_entry* inet_csk_route_req(struct sock *sk,
 					    const struct request_sock *req);

commit e89862f4c5b3c4ac9afcd8cb1365d2f1e16ddc3b
Author: David S. Miller <davem@sunset.davemloft.net>
Date:   Fri Jan 26 01:04:55 2007 -0800

    [TCP]: Restore SKB socket owner setting in tcp_transmit_skb().
    
    Revert 931731123a103cfb3f70ac4b7abfc71d94ba1f03
    
    We can't elide the skb_set_owner_w() here because things like certain
    netfilter targets (such as owner MATCH) need a socket to be set on the
    SKB for correct operation.
    
    Thanks to Jan Engelhardt and other netfilter list members for
    pointing this out.
    
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/net/inet_connection_sock.h b/include/net/inet_connection_sock.h
index bf16d98d372c..133cf30d2d79 100644
--- a/include/net/inet_connection_sock.h
+++ b/include/net/inet_connection_sock.h
@@ -37,8 +37,7 @@ struct tcp_congestion_ops;
  * (i.e. things that depend on the address family)
  */
 struct inet_connection_sock_af_ops {
-	int	    (*queue_xmit)(struct sk_buff *skb, struct sock *sk,
-				  int ipfragok);
+	int	    (*queue_xmit)(struct sk_buff *skb, int ipfragok);
 	void	    (*send_check)(struct sock *sk, int len,
 				  struct sk_buff *skb);
 	int	    (*rebuild_header)(struct sock *sk);

commit bd01f843c3368dcee735c19603251669f23f4477
Author: Al Viro <viro@zeniv.linux.org.uk>
Date:   Thu Oct 19 17:23:57 2006 -0400

    [PATCH] severing skbuff.h -> poll.h
    
    Signed-off-by: Al Viro <viro@zeniv.linux.org.uk>

diff --git a/include/net/inet_connection_sock.h b/include/net/inet_connection_sock.h
index cccea051e922..bf16d98d372c 100644
--- a/include/net/inet_connection_sock.h
+++ b/include/net/inet_connection_sock.h
@@ -18,6 +18,7 @@
 #include <linux/compiler.h>
 #include <linux/string.h>
 #include <linux/timer.h>
+#include <linux/poll.h>
 
 #include <net/inet_sock.h>
 #include <net/request_sock.h>

commit 850db6b8c53ff12eadee9ef2aa69360c06bce057
Author: Arnaldo Carvalho de Melo <acme@mandriva.com>
Date:   Mon Nov 27 17:56:43 2006 -0200

    [INET_CONNECTION_SOCK]: Pack struct inet_connection_sock_af_ops
    
    We have a hole in:
    
    [acme@newtoy net-2.6.20]$ pahole net/ipv6/tcp_ipv6.o inet_connection_sock_af_ops
    /* /pub/scm/linux/kernel/git/acme/net-2.6.20/include/net/inet_connection_sock.h:38 */
    struct inet_connection_sock_af_ops {
            int                        (*queue_xmit)();      /*     0     4 */
            void                       (*send_check)();      /*     4     4 */
            int                        (*rebuild_header)();  /*     8     4 */
            int                        (*conn_request)();    /*    12     4 */
            struct sock *              (*syn_recv_sock)();   /*    16     4 */
            int                        (*remember_stamp)();  /*    20     4 */
            __u16                      net_header_len;       /*    24     2 */
    
            /* XXX 2 bytes hole, try to pack */
    
            int                        (*setsockopt)();      /*    28     4 */
            int                        (*getsockopt)();      /*    32     4 */
            int                        (*compat_setsockopt)(); /*    36     4 */
            int                        (*compat_getsockopt)(); /*    40     4 */
            void                       (*addr2sockaddr)();   /*    44     4 */
            int                        sockaddr_len;         /*    48     4 */
    }; /* size: 52, sum members: 50, holes: 1, sum holes: 2 */
    
    But we don't need sockaddr_len to be an int:
    
    [acme@newtoy net-2.6.20]$ find net -name "*.[ch]" | xargs grep '\.sockaddr_len.\+=' | sort -u
    net/dccp/ipv4.c:        .sockaddr_len      = sizeof(struct sockaddr_in),
    net/dccp/ipv6.c:        .sockaddr_len      = sizeof(struct sockaddr_in6),
    net/ipv4/tcp_ipv4.c:    .sockaddr_len      = sizeof(struct sockaddr_in),
    net/ipv6/tcp_ipv6.c:    .sockaddr_len      = sizeof(struct sockaddr_in6),
    net/sctp/ipv6.c:        .sockaddr_len      = sizeof(struct sockaddr_in6),
    net/sctp/protocol.c:    .sockaddr_len      = sizeof(struct sockaddr_in),
    
    [acme@newtoy net-2.6.20]$ pahole --sizes net/ipv6/tcp_ipv6.o | grep sockaddr_in
    struct sockaddr_in: 16 0
    struct sockaddr_in6: 28 0
    [acme@newtoy net-2.6.20]$
    
    So I turned sockaddr_len a 'u16', and now:
    
    [acme@newtoy net-2.6.20]$ pahole net/ipv6/tcp_ipv6.o inet_connection_sock_af_ops
    /* /pub/scm/linux/kernel/git/acme/net-2.6.20/include/net/inet_connection_sock.h:38 */
    struct inet_connection_sock_af_ops {
            int            (*queue_xmit)();        /*     0   4 */
            void           (*send_check)();        /*     4   4 */
            int            (*rebuild_header)();    /*     8   4 */
            int            (*conn_request)();      /*    12   4 */
            struct sock *  (*syn_recv_sock)();     /*    16   4 */
            int            (*remember_stamp)();    /*    20   4 */
            u16            net_header_len;         /*    24   2 */
            u16            sockaddr_len;           /*    26   2 */
            int            (*setsockopt)();        /*    28   4 */
            int            (*getsockopt)();        /*    32   4 */
            int            (*compat_setsockopt)(); /*    36   4 */
            int            (*compat_getsockopt)(); /*    40   4 */
            void           (*addr2sockaddr)();     /*    44   4 */
    }; /* size: 48 */
    
    So we've saved 4 bytes:
    
    [acme@newtoy net-2.6.20]$ codiff -sV /tmp/tcp_ipv6.o.before net/ipv6/tcp_ipv6.o
    /pub/scm/linux/kernel/git/acme/net-2.6.20/net/ipv6/tcp_ipv6.c:
      struct inet_connection_sock_af_ops |   -4
        net_header_len;
         from: __u16                 /*    24(0)     2(0) */
         to:   u16                   /*    24(0)     2(0) */
        sockaddr_len;
         from: int                   /*    48(0)     4(0) */
         to:   u16                   /*    26(0)     2(0) */
     1 struct changed
    [acme@newtoy net-2.6.20]$
    
    Signed-off-by: Arnaldo Carvalho de Melo <acme@mandriva.com>

diff --git a/include/net/inet_connection_sock.h b/include/net/inet_connection_sock.h
index fd3f1d8cdc4a..cccea051e922 100644
--- a/include/net/inet_connection_sock.h
+++ b/include/net/inet_connection_sock.h
@@ -46,7 +46,8 @@ struct inet_connection_sock_af_ops {
 				      struct request_sock *req,
