commit ca44b738e59420ae73d9e04a1be630a405e3a0f1
Author: Vlad Buslov <vladbu@mellanox.com>
Date:   Fri May 15 14:40:12 2020 +0300

    net: sched: implement terse dump support in act
    
    Extend tcf_action_dump() with boolean argument 'terse' that is used to
    request terse-mode action dump. In terse mode only essential data needed to
    identify particular action (action kind, cookie, etc.) and its stats is put
    to resulting skb and everything else is omitted. Implement
    tcf_exts_terse_dump() helper in cls API that is intended to be used to
    request terse dump of all exts (actions) attached to the filter.
    
    Signed-off-by: Vlad Buslov <vladbu@mellanox.com>
    Reviewed-by: Jiri Pirko <jiri@mellanox.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/net/pkt_cls.h b/include/net/pkt_cls.h
index 04aa0649f3b0..ed65619cbc47 100644
--- a/include/net/pkt_cls.h
+++ b/include/net/pkt_cls.h
@@ -325,6 +325,7 @@ int tcf_exts_validate(struct net *net, struct tcf_proto *tp,
 void tcf_exts_destroy(struct tcf_exts *exts);
 void tcf_exts_change(struct tcf_exts *dst, struct tcf_exts *src);
 int tcf_exts_dump(struct sk_buff *skb, struct tcf_exts *exts);
+int tcf_exts_terse_dump(struct sk_buff *skb, struct tcf_exts *exts);
 int tcf_exts_dump_stats(struct sk_buff *skb, struct tcf_exts *exts);
 
 /**

commit 93a129eb8c520b032e1823447b2e1badcc650666
Author: Jiri Pirko <jiri@mellanox.com>
Date:   Sat Mar 28 16:37:43 2020 +0100


@@ -392,12 +392,21 @@ struct tc_cls_u32_offload {
 	};
 };
 
-static inline bool tc_should_offload(struct net_device *dev)
+/* tca flags definitions */
+#define TCA_CLS_FLAGS_SKIP_HW 1
+
+static inline bool tc_should_offload(struct net_device *dev, u32 flags)
 {
 	if (!(dev->features & NETIF_F_HW_TC))
 		return false;
 
-	return dev->netdev_ops->ndo_setup_tc;
+	if (flags & TCA_CLS_FLAGS_SKIP_HW)
+		return false;
+
+	if (!dev->netdev_ops->ndo_setup_tc)
+		return false;
+
+	return true;
 }
 
 #endif

commit 2b6ab0d3aae6bf1e08118060b0c5565778cd6b21
Author: John Fastabend <john.fastabend@gmail.com>
Date:   Fri Feb 26 07:54:13 2016 -0800

    net: cls_u32: move TC offload feature bit into cls_u32 offload logic
    
    In the original series drivers would get offload requests for cls_u32
    rules even if the feature bit is disabled. This meant the driver had
    to do a boiler plate check on the feature bit before adding/deleting
    the rule.
    
    This patch lifts the check into the core code and removes it from the
    driver specific case.
    
    Signed-off-by: John Fastabend <john.r.fastabend@intel.com>
    Acked-by: Jiri Pirko <jiri@mellanox.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/net/pkt_cls.h b/include/net/pkt_cls.h
index e64d20b81047..6096e96fb78b 100644
--- a/include/net/pkt_cls.h
+++ b/include/net/pkt_cls.h
@@ -394,6 +394,9 @@ struct tc_cls_u32_offload {
 
 static inline bool tc_should_offload(struct net_device *dev)
 {
+	if (!(dev->features & NETIF_F_HW_TC))
+		return false;
+
 	return dev->netdev_ops->ndo_setup_tc;
 }
 

commit 6843e7a2abe7cac10c19702ffec90018df6f040d
Author: John Fastabend <john.fastabend@gmail.com>
Date:   Fri Feb 26 07:53:49 2016 -0800

    net: sched: consolidate offload decision in cls_u32
    
    The offload decision was originally very basic and tied to if the dev
    implemented the appropriate ndo op hook. The next step is to allow
    the user to more flexibly define if any paticular rule should be
    offloaded or not. In order to have this logic in one function lift
    the current check into a helper routine tc_should_offload().
    
    Signed-off-by: John Fastabend <john.r.fastabend@intel.com>
    Acked-by: Jiri Pirko <jiri@mellanox.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/net/pkt_cls.h b/include/net/pkt_cls.h
index 2121df574262..e64d20b81047 100644
--- a/include/net/pkt_cls.h
+++ b/include/net/pkt_cls.h
@@ -392,4 +392,9 @@ struct tc_cls_u32_offload {
 	};
 };
 
+static inline bool tc_should_offload(struct net_device *dev)
+{
+	return dev->netdev_ops->ndo_setup_tc;
+}
+
 #endif

commit e014860e31e2a66b1a94088504360a6ebc023564
Author: John Fastabend <john.fastabend@gmail.com>
Date:   Wed Feb 17 14:59:30 2016 -0800

    net: pack tc_cls_u32_knode struct slighter better
    
    By packing the structure we can remove a few holes as Jamal
    suggests.
    
    before:
    
    struct tc_cls_u32_knode {
            struct tcf_exts *          exts;                 /*     0     8 */
            u8                         fshift;               /*     8     1 */
    
            /* XXX 3 bytes hole, try to pack */
    
            u32                        handle;               /*    12     4 */
            u32                        val;                  /*    16     4 */
            u32                        mask;                 /*    20     4 */
            u32                        link_handle;          /*    24     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            struct tc_u32_sel *        sel;                  /*    32     8 */
    
            /* size: 40, cachelines: 1, members: 7 */
            /* sum members: 33, holes: 2, sum holes: 7 */
            /* last cacheline: 40 bytes */
    };
    
    after:
    
    struct tc_cls_u32_knode {
            struct tcf_exts *          exts;                 /*     0     8 */
            struct tc_u32_sel *        sel;                  /*     8     8 */
            u32                        handle;               /*    16     4 */
            u32                        val;                  /*    20     4 */
            u32                        mask;                 /*    24     4 */
            u32                        link_handle;          /*    28     4 */
            u8                         fshift;               /*    32     1 */
    
            /* size: 40, cachelines: 1, members: 7 */
            /* padding: 7 */
            /* last cacheline: 40 bytes */
    };
    
    Suggested-by: Jamal Hadi Salim <jhs@mojatatu.com>
    Signed-off-by: John Fastabend <john.r.fastabend@intel.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/net/pkt_cls.h b/include/net/pkt_cls.h
index 59789ca6e2c8..2121df574262 100644
--- a/include/net/pkt_cls.h
+++ b/include/net/pkt_cls.h
@@ -360,12 +360,12 @@ tcf_match_indev(struct sk_buff *skb, int ifindex)
 
 struct tc_cls_u32_knode {
 	struct tcf_exts *exts;
-	u8 fshift;
+	struct tc_u32_sel *sel;
 	u32 handle;
 	u32 val;
 	u32 mask;
 	u32 link_handle;
-	struct tc_u32_sel *sel;
+	u8 fshift;
 };
 
 struct tc_cls_u32_hnode {

commit a1b7c5fd7fe98f51fbbc393ee1fc4c1cdb2f0119
Author: John Fastabend <john.fastabend@gmail.com>
Date:   Tue Feb 16 21:17:09 2016 -0800

    net: sched: add cls_u32 offload hooks for netdevs
    
