commit d6ff1b52b569dc12ba5be027bc6c22f4ac0f4ce1
Author: Colin Ian King <colin.king@canonical.com>
Date:   Wed Jul 11 12:47:28 2018 +0100

    staging: vt6655: remove some redundant variables
    
    Variables rx_sts, sq, frame and is_pspoll are being assigned but are
    never used hence they are redundant and can be removed.
    
    Cleans up clang warnings:
    warning: variable 'sq' set but not used [-Wunused-but-set-variable]
    warning: variable 'rx_sts' set but not used [-Wunused-but-set-variable]
    warning: variable 'frame' set but not used [-Wunused-but-set-variable]
    warning: variable 'is_pspoll' set but not used [-Wunused-but-set-variable]
    
    Signed-off-by: Colin Ian King <colin.king@canonical.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

diff --git a/drivers/staging/vt6655/dpc.c b/drivers/staging/vt6655/dpc.c
index 088d2d9dbc21..52214a30e9b6 100644
--- a/drivers/staging/vt6655/dpc.c
+++ b/drivers/staging/vt6655/dpc.c
@@ -34,7 +34,7 @@ static bool vnt_rx_data(struct vnt_private *priv, struct sk_buff *skb,
 	__le64 *tsf_time;
 	u16 frame_size;
 	int ii, r;
-	u8 *rx_sts, *rx_rate, *sq;
+	u8 *rx_rate;
 	u8 *skb_data;
 	u8 rate_idx = 0;
 	u8 rate[MAX_RATE] = {2, 4, 11, 22, 12, 18, 24, 36, 48, 72, 96, 108};
@@ -49,7 +49,6 @@ static bool vnt_rx_data(struct vnt_private *priv, struct sk_buff *skb,
 
 	skb_data = (u8 *)skb->data;
 
-	rx_sts = skb_data;
 	rx_rate = skb_data + 1;
 

-				// set tx map
+				/* set tx map */
 				pMgmt->abyPSTxMap[0] |= byMask[0];
 			}
 		} else {
 			bRelayAndForward = true;
 		}
 	} else {
-		// check if relay
+		/* check if relay */
 		if (BSSDBbIsSTAInNodeDB(pMgmt, (unsigned char *)(skb->data+cbHeaderOffset), &iDANodeIndex)) {
 			if (pMgmt->sNodeDBTable[iDANodeIndex].eNodeState >= NODE_ASSOC) {
 				if (pMgmt->sNodeDBTable[iDANodeIndex].bPSEnable) {
-					// queue this skb until next PS tx, and then release.
+					/* queue this skb until next PS tx, and then release. */
 
 					skb->data += cbHeaderOffset;
 					skb->tail += cbHeaderOffset;
@@ -1296,7 +1305,7 @@ static bool s_bAPModeRxData(
 	}
 
 	if (bRelayOnly || bRelayAndForward) {
-		// relay this packet right now
+		/* relay this packet right now */
 		if (bRelayAndForward)
 			iDANodeIndex = 0;
 
@@ -1306,7 +1315,7 @@ static bool s_bAPModeRxData(
 		if (bRelayOnly)
 			return false;
 	}
-	// none associate, don't forward
+	/* none associate, don't forward */
 	if (pDevice->uAssocCount == 0)
 		return false;
 

commit 1d06bb4e9df30162d8690a26792611a141676279
Author: Jiayi Ye <yejiayily@gmail.com>
Date:   Sat Oct 25 10:58:28 2014 +0800

    staging: remove unneeded parentheses around the right hand side of an assignment
    
    In assignments such as value = (FLASH_CMD_STATUS_REG_READ << 24);, parentheses
    are not needed. The Coccinelle semantic patch was used to find cases.
    
    @r@
    identifier x;
    expression e1, e2;
    @@
    
    - x = (e1 << e2);
    + x = e1 << e2;
    
    Signed-off-by: Jiayi Ye <yejiayily@gmail.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

diff --git a/drivers/staging/vt6655/dpc.c b/drivers/staging/vt6655/dpc.c
index 344e12f1184e..eecf6f559e29 100644
--- a/drivers/staging/vt6655/dpc.c
+++ b/drivers/staging/vt6655/dpc.c
@@ -358,7 +358,7 @@ device_receive_frame(
 		if ((*pbyRsr & RSR_CRCOK) != 0)
 			pDevice->byBasicMap |= 0x01;
 
-		dwDuration = (FrameSize << 4);
+		dwDuration = FrameSize << 4;
 		dwDuration /= acbyRxRate[*pbyRxRate%MAX_RATE];
 		if (*pbyRxRate <= RATE_11M) {
 			if (*pbyRxSts & 0x01) {

commit 87bb326eada535ed72ca312878bb5ba69bad870b
Author: Aya Mahfouz <mahfouz.saif.elyazal@gmail.com>
Date:   Sat Oct 11 02:34:07 2014 +0200

    staging: vt6655: dpc.c: replace memcpy() by ether_addr_copy() using coccinelle
    
    This patch focuses on fixing the following warning generated
    by checkpatch.pl for the file dpc.c :
    
    Prefer ether_addr_copy() over memcpy() if the Ethernet addresses
    are __aligned(2)
    
    The changes were applied using the following coccinelle rule:
    
    @@ expression e1, e2; @@
    
    - memcpy(e1, e2, ETH_ALEN);
    + ether_addr_copy(e1, e2);
    
    According to ether_addr_copy() description and functionality,
    all Ethernet addresses should align to the u16 datatype.
    
    Here is the output of pahole for the relevant datastructures:
    
    struct tagS802_11Header {
            short unsigned int         wFrameCtl;            /*     0     2 */
            short unsigned int         wDurationID;          /*     2     2 */
            unsigned char              abyAddr1[6];          /*     4     6 */
            unsigned char              abyAddr2[6];          /*    10     6 */
            unsigned char              abyAddr3[6];          /*    16     6 */
            short unsigned int         wSeqCtl;              /*    22     2 */
            unsigned char              abyAddr4[6];          /*    24     6 */
    
            /* size: 30, cachelines: 1, members: 7 */
            /* last cacheline: 30 bytes */
    };
    struct iw_michaelmicfailure {
            __u32                      flags;                /*     0     4 */
            struct sockaddr            src_addr;             /*     4    16 */
            __u8                       tsc[8];               /*    20     8 */
    
            /* size: 28, cachelines: 1, members: 3 */
            /* last cacheline: 28 bytes */
    };
    struct sockaddr {
            sa_family_t                sa_family;            /*     0     2 */
            char                       sa_data[14];          /*     2    14 */
    
            /* size: 16, cachelines: 1, members: 2 */
            /* last cacheline: 16 bytes */
    };
    
    There is one thing to note though, sa_data is a char array of size 14.
    And the number of bytes copied using memcpy() or ether_addr_copy()
    is 6.
    
    Signed-off-by: Aya Mahfouz <mahfouz.saif.elyazal@gmail.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

diff --git a/drivers/staging/vt6655/dpc.c b/drivers/staging/vt6655/dpc.c
index 8515b8c80801..344e12f1184e 100644
--- a/drivers/staging/vt6655/dpc.c
+++ b/drivers/staging/vt6655/dpc.c
@@ -742,7 +742,8 @@ device_receive_frame(
 					}
 
 					ev.src_addr.sa_family = ARPHRD_ETHER;
-					memcpy(ev.src_addr.sa_data, pMACHeader->abyAddr2, ETH_ALEN);
+					ether_addr_copy(ev.src_addr.sa_data,
+							pMACHeader->abyAddr2);
 					memset(&wrqu, 0, sizeof(wrqu));
 					wrqu.data.length = sizeof(ev);
