commit f558b8364e19f9222e7976c64e9367f66bab02cc
Merge: 80ef846e9909 8c3e315d4296
Author: Linus Torvalds <torvalds@linux-foundation.org>
Date:   Sun Jun 7 10:53:36 2020 -0700

    Merge tag 'driver-core-5.8-rc1' of git://git.kernel.org/pub/scm/linux/kernel/git/gregkh/driver-core
    
    Pull driver core updates from Greg KH:
     "Here is the set of driver core patches for 5.8-rc1.
    
      Not all that huge this release, just a number of small fixes and
      updates:
    
       - software node fixes
    
       - kobject now sends KOBJ_REMOVE when it is removed from sysfs, not
         when it is removed from memory (which could come much later)
    
       - device link additions and fixes based on testing on more devices
    
       - firmware core cleanups
    
       - other minor changes, full details in the shortlog
    
      All have been in linux-next for a while with no reported issues"
    
    * tag 'driver-core-5.8-rc1' of git://git.kernel.org/pub/scm/linux/kernel/git/gregkh/driver-core: (23 commits)
      driver core: Update device link status correctly for SYNC_STATE_ONLY links
      firmware_loader: change enum fw_opt to u32
      software node: implement software_node_unregister()
      kobject: send KOBJ_REMOVE uevent when the object is removed from sysfs
      driver core: Remove unnecessary is_fwnode_dev variable in device_add()
      drivers property: When no children in primary, try secondary

+	struct platform_device *pdev = to_platform_device(dev);
+	char *driver_override, *old = pdev->driver_override, *cp;
+
+	if (count > PATH_MAX)
+		return -EINVAL;
+
+	driver_override = kstrndup(buf, count, GFP_KERNEL);
+	if (!driver_override)
+		return -ENOMEM;
+
+	cp = strchr(driver_override, '\n');
+	if (cp)
+		*cp = '\0';
+
+	if (strlen(driver_override)) {
+		pdev->driver_override = driver_override;
+	} else {
+		kfree(driver_override);
+		pdev->driver_override = NULL;
+	}
+
+	kfree(old);
+
+	return count;
+}
+
+static ssize_t driver_override_show(struct device *dev,
+				    struct device_attribute *attr, char *buf)
+{
+	struct platform_device *pdev = to_platform_device(dev);
+
+	return sprintf(buf, "%s\n", pdev->driver_override);
+}
+static DEVICE_ATTR_RW(driver_override);
+
+
 static struct attribute *platform_dev_attrs[] = {
 	&dev_attr_modalias.attr,
+	&dev_attr_driver_override.attr,
 	NULL,
 };
 ATTRIBUTE_GROUPS(platform_dev);
@@ -755,6 +798,10 @@ static int platform_match(struct device *dev, struct device_driver *drv)
 	struct platform_device *pdev = to_platform_device(dev);
 	struct platform_driver *pdrv = to_platform_driver(drv);
 
+	/* When driver_override is set, only bind to the matching driver */
+	if (pdev->driver_override)
+		return !strcmp(pdev->driver_override, drv->name);
+
 	/* Attempt an OF style match first */
 	if (of_driver_match_device(dev, drv))
 		return 1;

commit 1cec24c59b4a133fc9c83912996168f511075485
Author: Yann Droneaud <ydroneaud@opteya.com>
Date:   Fri May 30 22:02:47 2014 +0200

    driver core/platform: remove unused implicit padding in platform_object
    
    Up to 7 bytes are wasted at the end of struct platform_object
    in the form of padding after name field: unfortunately this
    padding is not used when allocating the memory to hold the
    name.
    
    This patch converts name array from name[1] to C99 flexible
    array name[] (equivalent to name[0]) so that no padding is
    required by the presence of this field. Memory allocation
    is updated to take care of allocating an additional byte for
    the NUL terminating character.
    
    Built on Fedora 20, using GCC 4.8, for ARM, i386, SPARC64 and
    x86_64 architectures, the data structure layout can be reported
    with following command:
    
      $ pahole drivers/base/platform.o \
               --recursive             \
               --class_name device,pdev_archdata,platform_device,platform_object
    
    Please find below some comparisons of structure layout for arm,
    i386, sparc64 and x86_64 architecture before and after the patch.
    
      --- obj-arm/drivers/base/platform.o.pahole.v3.15-rc7-79-gfe45736f4134 2014-05-30 10:32:06.290960701 +0200
      +++ obj-arm/drivers/base/platform.o.pahole.v3.15-rc7-80-g2cdb06858d71 2014-05-30 11:26:20.851988347 +0200
      @@ -81,10 +81,9 @@
         /* XXX last struct has 4 bytes of padding */
    
            /* --- cacheline 6 boundary (384 bytes) was 8 bytes ago --- */
      -     char                       name[1];              /*   392     1 */
      +     char                       name[0];              /*   392     0 */
    
      -     /* size: 400, cachelines: 7, members: 2 */
      -     /* padding: 7 */
      +     /* size: 392, cachelines: 7, members: 2 */
            /* paddings: 1, sum paddings: 4 */
      -     /* last cacheline: 16 bytes */
      +     /* last cacheline: 8 bytes */
       };
    
      --- obj-i386/drivers/base/platform.o.pahole.v3.15-rc7-79-gfe45736f4134 2014-05-30 10:32:06.305960691 +0200
      +++ obj-i386/drivers/base/platform.o.pahole.v3.15-rc7-80-g2cdb06858d71 2014-05-30 11:26:20.875988332 +0200
      @@ -73,9 +73,8 @@
       struct platform_object {
            struct platform_device     pdev;                 /*     0   396 */
            /* --- cacheline 6 boundary (384 bytes) was 12 bytes ago --- */
      -     char                       name[1];              /*   396     1 */
      +     char                       name[0];              /*   396     0 */
    
      -     /* size: 400, cachelines: 7, members: 2 */
      -     /* padding: 3 */
      -     /* last cacheline: 16 bytes */
      +     /* size: 396, cachelines: 7, members: 2 */
      +     /* last cacheline: 12 bytes */
       };
    
      --- obj-sparc64/drivers/base/platform.o.pahole.v3.15-rc7-79-gfe45736f4134 2014-05-30 10:32:06.406960625 +0200
      +++ obj-sparc64/drivers/base/platform.o.pahole.v3.15-rc7-80-g2cdb06858d71 2014-05-30 11:26:20.971988269 +0200
      @@ -94,9 +94,8 @@
       struct platform_object {
            struct platform_device     pdev;                 /*     0  2208 */
            /* --- cacheline 34 boundary (2176 bytes) was 32 bytes ago --- */
      -     char                       name[1];              /*  2208     1 */
      +     char                       name[0];              /*  2208     0 */
    
      -     /* size: 2216, cachelines: 35, members: 2 */
      -     /* padding: 7 */
      -     /* last cacheline: 40 bytes */
      +     /* size: 2208, cachelines: 35, members: 2 */
      +     /* last cacheline: 32 bytes */
       };
    
      --- obj-x86_64/drivers/base/platform.o.pahole.v3.15-rc7-79-gfe45736f4134 2014-05-30 10:32:06.432960608 +0200
      +++ obj-x86_64/drivers/base/platform.o.pahole.v3.15-rc7-80-g2cdb06858d71 2014-05-30 11:26:21.000988250 +0200
      @@ -84,9 +84,8 @@
       struct platform_object {
            struct platform_device     pdev;                 /*     0   720 */
            /* --- cacheline 11 boundary (704 bytes) was 16 bytes ago --- */
      -     char                       name[1];              /*   720     1 */
      +     char                       name[0];              /*   720     0 */
    
      -     /* size: 728, cachelines: 12, members: 2 */
      -     /* padding: 7 */
      -     /* last cacheline: 24 bytes */
      +     /* size: 720, cachelines: 12, members: 2 */
      +     /* last cacheline: 16 bytes */
       };
    
    Changes from v5 [1]:
    - dropped dma_mask allocation changes and only kept padding
      removal changes (name array length set to 0).
    
    Changes from v4 [2]:
    [by Emil Goode <emilgoode@gmail.com>:]
    - Split v4 of the patch into two separate patches.
    - Generated new object file size and data structure layout info.
    - Updated the changelog message.
    
    Changes from v3 [3]:
    - fixed commit message so that git am doesn't fail.
    
    Changes from v2 [4]:
    - move 'dma_mask' to platform_object so that it's always
      allocated and won't leak on release; remove all previously
      added support functions.
    - use C99 flexible array member for 'name' to remove padding
