commit 6f91ea283a1ed23e4a548ddd62db6deb2c707f82
Author: Kan Liang <kan.liang@linux.intel.com>
Date:   Thu Mar 19 13:25:02 2020 -0700

    perf header: Support CPU PMU capabilities
    
    To stitch LBR call stack, the max LBR information is required. So the
    CPU PMU capabilities information has to be stored in perf header.
    
    Add a new feature HEADER_CPU_PMU_CAPS for CPU PMU capabilities.
    Retrieve all CPU PMU capabilities, not just max LBR information.
    
    Add variable max_branches to facilitate future usage.
    
    Committer testing:
    
      # ls -la /sys/devices/cpu/caps/
      total 0
      drwxr-xr-x. 2 root root    0 Apr 17 10:53 .
      drwxr-xr-x. 6 root root    0 Apr 17 07:02 ..
      -r--r--r--. 1 root root 4096 Apr 17 10:53 max_precise
      #
      # cat /sys/devices/cpu/caps/max_precise
      0
      # perf record sleep 1
      [ perf record: Woken up 1 times to write data ]
      [ perf record: Captured and wrote 0.033 MB perf.data (7 samples) ]
      #
      # perf report --header-only | egrep 'cpu(desc|.*capabilities)'
      # cpudesc : AMD Ryzen 5 3600X 6-Core Processor
      # cpu pmu capabilities: max_precise=0
      #
    
    And then on an Intel machine:
    
      $ ls -la /sys/devices/cpu/caps/
      total 0
      drwxr-xr-x. 2 root root    0 Apr 17 10:51 .
      drwxr-xr-x. 6 root root    0 Apr 17 10:04 ..
      -r--r--r--. 1 root root 4096 Apr 17 11:37 branches
      -r--r--r--. 1 root root 4096 Apr 17 10:51 max_precise

@@ -151,7 +147,9 @@ int perf_event__process_build_id(struct perf_tool *tool,
 				 struct perf_session *session);
 bool is_perf_magic(u64 magic);
 
-int dsos__hit_all(struct perf_session *session);
+#define NAME_ALIGN 64
+
+int write_padded(int fd, const void *bf, size_t count, size_t count_aligned);
 
 /*
  * arch specific callback

commit 1f625b0b3dd641b74ba21640a1fea19a3dd893a2
Author: Adrian Hunter <adrian.hunter@intel.com>
Date:   Tue Jul 22 16:17:23 2014 +0300

    perf tools: Add dsos__hit_all()
    
    Add ability to mark all dsos as hit.
    
    This is needed in the case of Instruction Tracing.  It takes so long to
    decode an Instruction Trace that it is not worth doing just to determine
    which dsos are hit.  A later patch takes this into use.
    
    Signed-off-by: Adrian Hunter <adrian.hunter@intel.com>
    Cc: David Ahern <dsahern@gmail.com>
    Cc: Frederic Weisbecker <fweisbec@gmail.com>
    Cc: Jiri Olsa <jolsa@redhat.com>
    Cc: Namhyung Kim <namhyung@gmail.com>
    Cc: Paul Mackerras <paulus@samba.org>
    Cc: Peter Zijlstra <peterz@infradead.org>
    Cc: Stephane Eranian <eranian@google.com>
    Link: http://lkml.kernel.org/r/1406035081-14301-15-git-send-email-adrian.hunter@intel.com
    Signed-off-by: Arnaldo Carvalho de Melo <acme@redhat.com>

diff --git a/tools/perf/util/header.h b/tools/perf/util/header.h
index d08cfe499404..8f5cbaea64a5 100644
--- a/tools/perf/util/header.h
+++ b/tools/perf/util/header.h
@@ -151,6 +151,8 @@ int perf_event__process_build_id(struct perf_tool *tool,
 				 struct perf_session *session);
 bool is_perf_magic(u64 magic);
 
+int dsos__hit_all(struct perf_session *session);
+
 /*
  * arch specific callback
  */

commit d944c4eebcf4c0d5e5d9728fec110cbf0047ad7f
Author: Borislav Petkov <bp@suse.de>
Date:   Fri Apr 25 21:31:02 2014 +0200

    tools: Consolidate types.h
    
    Combine all definitions into a common tools/include/linux/types.h and
    kill the wild growth elsewhere. Move DECLARE_BITMAP to its proper
    bitmap.h header.
    
    Signed-off-by: Borislav Petkov <bp@suse.de>
    Acked-by: Rusty Russell <rusty@rustcorp.com.au>
    Link: http://lkml.kernel.org/n/tip-azczs7qcv6h9xek9od10hiv2@git.kernel.org
    Signed-off-by: Jiri Olsa <jolsa@kernel.org>

diff --git a/tools/perf/util/header.h b/tools/perf/util/header.h
index a2d047bdf4ef..d08cfe499404 100644
--- a/tools/perf/util/header.h
+++ b/tools/perf/util/header.h
@@ -4,10 +4,10 @@
 #include <linux/perf_event.h>
 #include <sys/types.h>
 #include <stdbool.h>
-#include "types.h"
+#include <linux/bitmap.h>
+#include <linux/types.h>
 #include "event.h"
 
-#include <linux/bitmap.h>
 
 enum {
 	HEADER_RESERVED		= 0,	/* always cleared */

commit 3ba4d2e1a8235d862657ded9f20b3170b477768b
Author: Arnaldo Carvalho de Melo <acme@redhat.com>
Date:   Mon Jan 6 15:28:35 2014 -0300

    perf header: Pack 'struct perf_session_env'
    
    Initial struct:
    
    [acme@ssdandy linux]$ pahole -C perf_session_env ~/bin/perf
    struct perf_session_env {
            char *                     hostname;             /*     0     8 */
            char *                     os_release;           /*     8     8 */
            char *                     version;              /*    16     8 */
            char *                     arch;                 /*    24     8 */
            int                        nr_cpus_online;       /*    32     4 */
            int                        nr_cpus_avail;        /*    36     4 */
            char *                     cpu_desc;             /*    40     8 */
            char *                     cpuid;                /*    48     8 */
            long long unsigned int     total_mem;            /*    56     8 */
            /* --- cacheline 1 boundary (64 bytes) --- */
            int                        nr_cmdline;           /*    64     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            char *                     cmdline;              /*    72     8 */
            int                        nr_sibling_cores;     /*    80     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            char *                     sibling_cores;        /*    88     8 */
            int                        nr_sibling_threads;   /*    96     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            char *                     sibling_threads;      /*   104     8 */
            int                        nr_numa_nodes;        /*   112     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            char *                     numa_nodes;           /*   120     8 */
            /* --- cacheline 2 boundary (128 bytes) --- */
            int                        nr_pmu_mappings;      /*   128     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            char *                     pmu_mappings;         /*   136     8 */
            int                        nr_groups;            /*   144     4 */
    
            /* size: 152, cachelines: 3, members: 20 */
            /* sum members: 128, holes: 5, sum holes: 20 */
            /* padding: 4 */
            /* last cacheline: 24 bytes */
    };
    [acme@ssdandy linux]$
    
    [acme@ssdandy linux]$ pahole -C perf_session_env --reorganize --show_reorg_steps ~/bin/perf | grep ^/ | grep -v Final
    /* Moving 'nr_sibling_cores' from after 'cmdline' to after 'nr_cmdline' */
    /* Moving 'nr_numa_nodes' from after 'sibling_threads' to after 'nr_sibling_threads' */
    /* Moving 'nr_groups' from after 'pmu_mappings' to after 'nr_pmu_mappings' */
    [acme@ssdandy linux]$
    
    Final struct stats:
    
    [acme@ssdandy linux]$ pahole -C perf_session_env --reorganize --show_reorg_steps ~/bin/perf | tail -4
            /* --- cacheline 2 boundary (128 bytes) --- */
    
            /* size: 128, cachelines: 2, members: 20 */
    };   /* saved 24 bytes and 1 cacheline! */
    [acme@ssdandy linux]$
