commit 357a5d24c4715d454f8acd6796e2adaaef0c48ed
Author: Arnaldo Carvalho de Melo <acme@redhat.com>
Date:   Thu Feb 27 11:43:53 2020 -0300

    perf llvm: Add debug hint message about missing kernel-devel package
    
    To help in debugging, add this extra message:
    
      detect_kbuild_dir: Couldn't find "/lib/modules/5.4.20-200.fc31.x86_64/build/include/generated/autoconf.h", missing kernel-devel package?.
    
    Cc: Adrian Hunter <adrian.hunter@intel.com>
    Cc: Jiri Olsa <jolsa@kernel.org>
    Cc: Namhyung Kim <namhyung@kernel.org>
    Signed-off-by: Arnaldo Carvalho de Melo <acme@redhat.com>

diff --git a/tools/perf/util/llvm-utils.c b/tools/perf/util/llvm-utils.c
index b5af680fc667..dbdffb6673fe 100644
--- a/tools/perf/util/llvm-utils.c
+++ b/tools/perf/util/llvm-utils.c
@@ -265,6 +265,8 @@ static int detect_kbuild_dir(char **kbuild_dir)
 			return -ENOMEM;
 		return 0;
 	}
+	pr_debug("%s: Couldn't find \"%s\", missing kernel-devel package?.\n",
+		 __func__, autoconf_path);
 	free(autoconf_path);
 	return -ENOENT;
 }

commit 62765941155e487b351a72479078bd6fec973563
Author: Arnaldo Carvalho de Melo <acme@redhat.com>
Date:   Fri Feb 14 09:34:43 2020 -0300

    perf llvm: Fix script used to obtain kernel make directives to work with new kbuild
    
    Before this patch:
    
      # ./perf test 39 41
      39: LLVM search and compile                               :
      39.1: Basic BPF llvm compile                              : Ok

+++ b/tools/perf/util/llvm-utils.c
@@ -9,6 +9,7 @@
 #include <stdio.h>
 #include <stdlib.h>
 #include <linux/err.h>
+#include <linux/zalloc.h>
 #include "debug.h"
 #include "llvm-utils.h"
 #include "config.h"

commit d35b168c3dcdf103c2b2d694ad8513a669781703
Author: Arnaldo Carvalho de Melo <acme@redhat.com>
Date:   Wed Aug 29 23:53:22 2018 -0300

    perf bpf: Give precedence to bpf header dir
    
    I need to check the need for $KERNEL_INC_OPTIONS when building eBPF
    restricted C programs, for now just give precedence to
    $PERF_BPF_INC_OPTIONS so that we can get a linux/socket.h usable
    in eBPF programs.
    
    Cc: Adrian Hunter <adrian.hunter@intel.com>
    Cc: David Ahern <dsahern@gmail.com>
    Cc: Jiri Olsa <jolsa@kernel.org>
    Cc: Namhyung Kim <namhyung@kernel.org>
    Cc: Wang Nan <wangnan0@huawei.com>
    Link: https://lkml.kernel.org/n/tip-5z7qw529sdebrn9y1xxqw9hf@git.kernel.org
    Signed-off-by: Arnaldo Carvalho de Melo <acme@redhat.com>

diff --git a/tools/perf/util/llvm-utils.c b/tools/perf/util/llvm-utils.c
index 19262f98cd4e..5b0b60f00275 100644
--- a/tools/perf/util/llvm-utils.c
+++ b/tools/perf/util/llvm-utils.c
@@ -19,7 +19,7 @@
 #define CLANG_BPF_CMD_DEFAULT_TEMPLATE				\
 		"$CLANG_EXEC -D__KERNEL__ -D__NR_CPUS__=$NR_CPUS "\
 		"-DLINUX_VERSION_CODE=$LINUX_VERSION_CODE "	\
-		"$CLANG_OPTIONS $KERNEL_INC_OPTIONS $PERF_BPF_INC_OPTIONS " \
+		"$CLANG_OPTIONS $PERF_BPF_INC_OPTIONS $KERNEL_INC_OPTIONS " \
 		"-Wno-unused-value -Wno-pointer-sign "		\
 		"-working-directory $WORKING_DIR "		\
 		"-c \"$CLANG_SOURCE\" -target bpf $CLANG_EMIT_LLVM -O2 -o - $LLVM_OPTIONS_PIPE"

commit cb76371441d0984824a6e66f8f3d369f037edb34
Author: Arnaldo Carvalho de Melo <acme@redhat.com>
Date:   Wed Aug 15 17:07:01 2018 -0300

    perf llvm: Allow passing options to llc in addition to clang
    
    The newly added 'llvm.opts' variable allows passing options directly to
    llc, like needed to get sane DWARF in BPF ELF debug sections:
    
    With:
    
      [root@seventh perf]# cat ~/.perfconfig
      [llvm]
              dump-obj = true
            clang-opt = -g
      [root@seventh perf]#
    
    We get:
    
      [root@seventh perf]# perf trace -e tools/perf/examples/bpf/hello.c cat /etc/passwd > /dev/null
      LLVM: dumping tools/perf/examples/bpf/hello.o
           0.000 __bpf_stdout__:Hello, world
           0.015 __bpf_stdout__:Hello, world
           0.187 __bpf_stdout__:Hello, world
      [root@seventh perf]# pahole tools/perf/examples/bpf/hello.o
      struct clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566eefef9c3777bd780ec4cbb9efa764633b76c) {
              clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566e.org clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566eefef9c3777bd780ec4cbb9efa764633b76c); /*     0     4 */
              clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566e.org clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566eefef9c3777bd780ec4cbb9efa764633b76c); /*     4     4 */
              clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566e.org clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566eefef9c3777bd780ec4cbb9efa764633b76c); /*     8     4 */
              clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566e.org clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566eefef9c3777bd780ec4cbb9efa764633b76c); /*    12     4 */
              clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566e.org clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566eefef9c3777bd780ec4cbb9efa764633b76c); /*    16     4 */
              clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566e.org clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566eefef9c3777bd780ec4cbb9efa764633b76c); /*    20     4 */
              clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566e.org clang version 8.0.0 (http://llvm.org/git/clang.git 8587270a739ee30c926a76d5657e65e85b560f6e) (http://llvm.org/git/llvm.git 0566eefef9c3777bd780ec4cbb9efa764633b76c); /*    24     4 */
    
              /* size: 28, cachelines: 1, members: 7 */
              /* last cacheline: 28 bytes */
      };
      [root@seventh perf]#
    
    Adding these options to be passed to llvm's llc:
    
      [root@seventh perf]# cat ~/.perfconfig
      [llvm]
              dump-obj = true
              clang-opt = -g
              opts = -mattr=dwarfris
      [root@seventh perf]#
    
    We get sane output:
    
      [root@seventh perf]# perf trace -e tools/perf/examples/bpf/hello.c cat /etc/passwd > /dev/null
      LLVM: dumping tools/perf/examples/bpf/hello.o
           0.000 __bpf_stdout__:Hello, world
           0.015 __bpf_stdout__:Hello, world
           0.185 __bpf_stdout__:Hello, world
      [root@seventh perf]# pahole tools/perf/examples/bpf/hello.o
      struct bpf_map {
              unsigned int               type;                 /*     0     4 */
              unsigned int               key_size;             /*     4     4 */
              unsigned int               value_size;           /*     8     4 */
              unsigned int               max_entries;          /*    12     4 */
              unsigned int               map_flags;            /*    16     4 */
              unsigned int               inner_map_idx;        /*    20     4 */
              unsigned int               numa_node;            /*    24     4 */
    
              /* size: 28, cachelines: 1, members: 7 */
              /* last cacheline: 28 bytes */
      };
      [root@seventh perf]#
    
    Cc: Alexei Starovoitov <ast@fb.com>
    Cc: Daniel Borkmann <daniel@iogearbox.net>
    Cc: Jiri Olsa <jolsa@kernel.org>
    Cc: Martin KaFai Lau <kafai@fb.com>
    Cc: Namhyung Kim <namhyung@kernel.org>
    Cc: Wang Nan <wangnan0@huawei.com>,
    Cc: Yonghong Song <yhs@fb.com>
    Link: https://lkml.kernel.org/n/tip-0lrwmrip4dru1651rm8xa7tq@git.kernel.org
    Signed-off-by: Arnaldo Carvalho de Melo <acme@redhat.com>

diff --git a/tools/perf/util/llvm-utils.c b/tools/perf/util/llvm-utils.c
index 5e94857dfca2..19262f98cd4e 100644
--- a/tools/perf/util/llvm-utils.c
+++ b/tools/perf/util/llvm-utils.c
@@ -22,12 +22,14 @@
 		"$CLANG_OPTIONS $KERNEL_INC_OPTIONS $PERF_BPF_INC_OPTIONS " \
 		"-Wno-unused-value -Wno-pointer-sign "		\
 		"-working-directory $WORKING_DIR "		\
