commit 2771cefeac499d68ca2fca3861ba9e46d15bd4ae
Author: Christoph Hellwig <hch@lst.de>
Date:   Mon May 4 18:10:05 2020 +0200

    block: remove the REQ_NOWAIT_INLINE flag
    
    Signed-off-by: Christoph Hellwig <hch@lst.de>
    Reviewed-by: Chaitanya Kulkarni <chaitanya.kulkarni@wdc.com>
    Signed-off-by: Jens Axboe <axboe@kernel.dk>

diff --git a/include/linux/blk_types.h b/include/linux/blk_types.h
index 9322261fb316..ccb895f911b1 100644
--- a/include/linux/blk_types.h
+++ b/include/linux/blk_types.h
@@ -343,7 +343,6 @@ enum req_flag_bits {
 	__REQ_RAHEAD,		/* read ahead, can fail anytime */
 	__REQ_BACKGROUND,	/* background IO */
 	__REQ_NOWAIT,           /* Don't wait if request will block */
-	__REQ_NOWAIT_INLINE,	/* Return would-block error inline */
 	/*
 	 * When a shared kthread needs to issue a bio for a cgroup, doing
 	 * so synchronously can lead to priority inversions as the kthread
@@ -378,7 +377,6 @@ enum req_flag_bits {
 #define REQ_RAHEAD		(1ULL << __REQ_RAHEAD)
 #define REQ_BACKGROUND		(1ULL << __REQ_BACKGROUND)
 #define REQ_NOWAIT		(1ULL << __REQ_NOWAIT)
-#define REQ_NOWAIT_INLINE	(1ULL << __REQ_NOWAIT_INLINE)
 #define REQ_CGROUP_PUNT		(1ULL << __REQ_CGROUP_PUNT)
 
 #define REQ_NOUNMAP		(1ULL << __REQ_NOUNMAP)

commit a892c8d52c02284076fbbacae6692aa5c5807d11
Author: Satya Tangirala <satyat@google.com>
Date:   Thu May 14 00:37:18 2020 +0000

    block: Inline encryption support for blk-mq
    

    * Open a zone: Transition to open condition to indicate that a zone will
      actively be written
    * Close a zone: Transition to closed condition to release the drive
      resources used for writing to a zone
    * Finish a zone: Transition an open or closed zone to the full
      condition to prevent write operations
    
    To enable this control for in-kernel zoned block device users, define
    the new request operations REQ_OP_ZONE_OPEN, REQ_OP_ZONE_CLOSE
    and REQ_OP_ZONE_FINISH as well as the generic function
    blkdev_zone_mgmt() for submitting these operations on a range of zones.
    This results in blkdev_reset_zones() removal and replacement with this
    new zone magement function. Users of blkdev_reset_zones() (f2fs and
    dm-zoned) are updated accordingly.
    
    Contains contributions from Matias Bjorling, Hans Holmberg,
    Dmitry Fomichev, Keith Busch, Damien Le Moal and Christoph Hellwig.
    
    Reviewed-by: Javier González <javier@javigon.com>
    Reviewed-by: Christoph Hellwig <hch@lst.de>
    Signed-off-by: Ajay Joshi <ajay.joshi@wdc.com>
    Signed-off-by: Matias Bjorling <matias.bjorling@wdc.com>
    Signed-off-by: Hans Holmberg <hans.holmberg@wdc.com>
    Signed-off-by: Dmitry Fomichev <dmitry.fomichev@wdc.com>
    Signed-off-by: Keith Busch <kbusch@kernel.org>
    Signed-off-by: Damien Le Moal <damien.lemoal@wdc.com>
    Signed-off-by: Jens Axboe <axboe@kernel.dk>

diff --git a/include/linux/blk_types.h b/include/linux/blk_types.h
index 1e7eeec16458..23a2fd534817 100644
--- a/include/linux/blk_types.h
+++ b/include/linux/blk_types.h
@@ -290,6 +290,12 @@ enum req_opf {
 	REQ_OP_ZONE_RESET_ALL	= 8,
 	/* write the zero filled sector many times */
 	REQ_OP_WRITE_ZEROES	= 9,
+	/* Open a zone */
+	REQ_OP_ZONE_OPEN	= 10,
+	/* Close a zone */
+	REQ_OP_ZONE_CLOSE	= 11,
+	/* Transition a zone to full */
+	REQ_OP_ZONE_FINISH	= 12,
 
 	/* SCSI passthrough using struct scsi_request */
 	REQ_OP_SCSI_IN		= 32,
@@ -417,6 +423,25 @@ static inline bool op_is_discard(unsigned int op)
 	return (op & REQ_OP_MASK) == REQ_OP_DISCARD;
 }
 
+/*
+ * Check if a bio or request operation is a zone management operation, with
+ * the exception of REQ_OP_ZONE_RESET_ALL which is treated as a special case
+ * due to its different handling in the block layer and device response in
+ * case of command failure.
+ */
+static inline bool op_is_zone_mgmt(enum req_opf op)
+{
+	switch (op & REQ_OP_MASK) {
+	case REQ_OP_ZONE_RESET:
+	case REQ_OP_ZONE_OPEN:
+	case REQ_OP_ZONE_CLOSE:
+	case REQ_OP_ZONE_FINISH:
+		return true;
+	default:
+		return false;
+	}
+}
+
 static inline int op_stat_group(unsigned int op)
 {
 	if (op_is_discard(op))

commit 993e4cdebb5a53bc87f21cdd34d1dc42225de43d
Author: David Sterba <dsterba@suse.com>
Date:   Thu Oct 24 19:31:10 2019 +0200

    block: reorder bio::__bi_remaining for better packing
    
    Simple reordering of __bi_remaining can reduce bio size by 8 bytes that
    are now wasted on padding (measured on x86_64):
    
    struct bio {
            struct bio *               bi_next;              /*     0     8 */
            struct gendisk *           bi_disk;              /*     8     8 */
            unsigned int               bi_opf;               /*    16     4 */
            short unsigned int         bi_flags;             /*    20     2 */
            short unsigned int         bi_ioprio;            /*    22     2 */
            short unsigned int         bi_write_hint;        /*    24     2 */
            blk_status_t               bi_status;            /*    26     1 */
            u8                         bi_partno;            /*    27     1 */
    
            /* XXX 4 bytes hole, try to pack */
    
            struct bvec_iter   bi_iter;                      /*    32    24 */
    
            /* XXX last struct has 4 bytes of padding */
    
            atomic_t                   __bi_remaining;       /*    56     4 */
    
            /* XXX 4 bytes hole, try to pack */
    [...]
            /* size: 104, cachelines: 2, members: 19 */
            /* sum members: 96, holes: 2, sum holes: 8 */
            /* paddings: 1, sum paddings: 4 */
            /* last cacheline: 40 bytes */
    };
    
    Now becomes:
    
    struct bio {
            struct bio *               bi_next;              /*     0     8 */
            struct gendisk *           bi_disk;              /*     8     8 */
            unsigned int               bi_opf;               /*    16     4 */
            short unsigned int         bi_flags;             /*    20     2 */
            short unsigned int         bi_ioprio;            /*    22     2 */
            short unsigned int         bi_write_hint;        /*    24     2 */
            blk_status_t               bi_status;            /*    26     1 */
            u8                         bi_partno;            /*    27     1 */
            atomic_t                   __bi_remaining;       /*    28     4 */
            struct bvec_iter   bi_iter;                      /*    32    24 */
    
            /* XXX last struct has 4 bytes of padding */
    [...]
            /* size: 96, cachelines: 2, members: 19 */
            /* paddings: 1, sum paddings: 4 */
            /* last cacheline: 32 bytes */
    };
    
    Signed-off-by: David Sterba <dsterba@suse.com>
    Signed-off-by: Jens Axboe <axboe@kernel.dk>

diff --git a/include/linux/blk_types.h b/include/linux/blk_types.h
index d688b96d1d63..1e7eeec16458 100644
--- a/include/linux/blk_types.h
+++ b/include/linux/blk_types.h
@@ -153,10 +153,10 @@ struct bio {
 	unsigned short		bi_write_hint;
 	blk_status_t		bi_status;
 	u8			bi_partno;
+	atomic_t		__bi_remaining;
 
 	struct bvec_iter	bi_iter;
 
-	atomic_t		__bi_remaining;
 	bio_end_io_t		*bi_end_io;
 
 	void			*bi_private;

commit 7caa47151ab2e644dd221f741ec7578d9532c9a3
Author: Tejun Heo <tj@kernel.org>
Date:   Wed Aug 28 15:05:58 2019 -0700

    blkcg: implement blk-iocost
    
