commit 480aeb9639d6a077c611b303a22f9b1e5937d081
Author: Christoph Hellwig <hch@lst.de>
Date:   Thu May 28 07:12:25 2020 +0200

    tcp: add tcp_sock_set_keepcnt
    
    Add a helper to directly set the TCP_KEEPCNT sockopt from kernel space
    without going through a fake uaccess.
    
    Signed-off-by: Christoph Hellwig <hch@lst.de>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/linux/tcp.h b/include/linux/tcp.h
index 1f9bada00faa..9aac824c523c 100644
--- a/include/linux/tcp.h
+++ b/include/linux/tcp.h
@@ -498,6 +498,7 @@ int tcp_skb_shift(struct sk_buff *to, struct sk_buff *from, int pcount,
 		  int shiftlen);
 
 void tcp_sock_set_cork(struct sock *sk, bool on);
+int tcp_sock_set_keepcnt(struct sock *sk, int val);
 int tcp_sock_set_keepidle(struct sock *sk, int val);
 int tcp_sock_set_keepintvl(struct sock *sk, int val);
 void tcp_sock_set_nodelay(struct sock *sk);

commit d41ecaac903c9f4658a71d4e7a708673cfb5abba
Author: Christoph Hellwig <hch@lst.de>
Date:   Thu May 28 07:12:24 2020 +0200

    tcp: add tcp_sock_set_keepintvl
    
    Add a helper to directly set the TCP_KEEPINTVL sockopt from kernel space
    without going through a fake uaccess.
    
    Signed-off-by: Christoph Hellwig <hch@lst.de>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/linux/tcp.h b/include/linux/tcp.h
index 5724dd84a85e..1f9bada00faa 100644
--- a/include/linux/tcp.h
+++ b/include/linux/tcp.h

    child socket locked, yet it is modifying state of the parent
    listening socket.
    
    Fixing that is non-trivial at best, because we can't simply just grab
    the parent listening socket lock at this point, because it would
    create an ABBA deadlock.  The normal ordering is parent listening
    socket --> child socket, but this code path would require the
    reverse lock ordering.
    
    Next is a problem noticed by Vitaliy Gusev, he noted:
    
    ----------------------------------------
    >--- a/net/ipv4/tcp_timer.c
    >+++ b/net/ipv4/tcp_timer.c
    >@@ -481,6 +481,11 @@ static void tcp_keepalive_timer (unsigned long data)
    >               goto death;
    >       }
    >
    >+      if (tp->defer_tcp_accept.request && sk->sk_state == TCP_ESTABLISHED) {
    >+              tcp_send_active_reset(sk, GFP_ATOMIC);
    >+              goto death;
    
    Here socket sk is not attached to listening socket's request queue. tcp_done()
    will not call inet_csk_destroy_sock() (and tcp_v4_destroy_sock() which should
    release this sk) as socket is not DEAD. Therefore socket sk will be lost for
    freeing.
    ----------------------------------------
    
    Finally, Alexey Kuznetsov argues that there might not even be any
    real value or advantage to these new semantics even if we fix all
    of the bugs:
    
    ----------------------------------------
    Hiding from accept() sockets with only out-of-order data only
    is the only thing which is impossible with old approach. Is this really
    so valuable? My opinion: no, this is nothing but a new loophole
    to consume memory without control.
    ----------------------------------------
    
    So revert this thing for now.
    
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/include/linux/tcp.h b/include/linux/tcp.h
index 18e62e3d406f..b31b6b74aa28 100644
--- a/include/linux/tcp.h
+++ b/include/linux/tcp.h
@@ -239,11 +239,6 @@ static inline struct tcp_request_sock *tcp_rsk(const struct request_sock *req)
 	return (struct tcp_request_sock *)req;
 }
 
-struct tcp_deferred_accept_info {
-	struct sock *listen_sk;
-	struct request_sock *request;
-};
-
 struct tcp_sock {
 	/* inet_connection_sock has to be the first member of tcp_sock */
 	struct inet_connection_sock	inet_conn;
@@ -379,8 +374,6 @@ struct tcp_sock {
 	unsigned int		keepalive_intvl;  /* time interval between keep alive probes */
 	int			linger2;
 
-	struct tcp_deferred_accept_info defer_tcp_accept;
-
 	unsigned long last_synq_overflow; 
 
 	u32	tso_deferred;

commit b79eeeb9e48457579cb742cd02e162fcd673c4a3
Author: Ilpo Jrvinen <ilpo.jarvinen@helsinki.fi>
Date:   Thu May 29 03:25:23 2008 -0700

    tcp: Reorganize tcp_sock to fill 64-bit holes & improve locality
    
    I tried to group recovery related fields nearby (non-CA_Open related
    variables, to be more accurate) so that one to three cachelines would
    not be necessary in CA_Open. These are now contiguously deployed:
    
      struct sk_buff_head        out_of_order_queue;   /*  1968    80 */
      /* --- cacheline 32 boundary (2048 bytes) --- */
      struct tcp_sack_block      duplicate_sack[1];    /*  2048     8 */
      struct tcp_sack_block      selective_acks[4];    /*  2056    32 */
      struct tcp_sack_block      recv_sack_cache[4];   /*  2088    32 */
      /* --- cacheline 33 boundary (2112 bytes) was 8 bytes ago --- */
      struct sk_buff *           highest_sack;         /*  2120     8 */
      int                        lost_cnt_hint;        /*  2128     4 */
      int                        retransmit_cnt_hint;  /*  2132     4 */
      u32                        lost_retrans_low;     /*  2136     4 */
      u8                         reordering;           /*  2140     1 */
      u8                         keepalive_probes;     /*  2141     1 */
    
      /* XXX 2 bytes hole, try to pack */
    
      u32                        prior_ssthresh;       /*  2144     4 */
      u32                        high_seq;             /*  2148     4 */
      u32                        retrans_stamp;        /*  2152     4 */
      u32                        undo_marker;          /*  2156     4 */
      int                        undo_retrans;         /*  2160     4 */
      u32                        total_retrans;        /*  2164     4 */
    
    ...and they're then followed by URG slowpath & keepalive related
    variables.
    
    Head of the out_of_order_queue always needed for empty checks, if
    that's empty (and TCP is in CA_Open), following ~200 bytes (in 64-bit)
    shouldn't be necessary for anything. If only OFO queue exists but TCP
    is in CA_Open, selective_acks (and possibly duplicate_sack) are
    necessary besides the out_of_order_queue but the rest of the block
    again shouldn't be (ie., the other direction had losses).
    
    As the cacheline boundaries depend on many factors in the preceeding
    stuff, trying to align considering them doesn't make too much sense.
    
    Commented one ordering hazard.
    
    There are number of low utilized u8/16s that could be combined get 2
    bytes less in total so that the hole could be made to vanish (includes
    at least ecn_flags, urg_data, urg_mode, frto_counter, nonagle).
    
