commit e9e2eae89ddb658ea332295153fdca78c12c1e0d
Author: Christoph Hellwig <hch@lst.de>
Date:   Wed Mar 18 08:15:10 2020 -0700

    xfs: only check the superblock version for dinode size calculation
    
    The size of the dinode structure is only dependent on the file system
    version, so instead of checking the individual inode version just use
    the newly added xfs_sb_version_has_large_dinode helper, and simplify
    various calling conventions.
    
    Signed-off-by: Christoph Hellwig <hch@lst.de>
    Reviewed-by: Brian Foster <bfoster@redhat.com>
    Reviewed-by: Chandan Rajendra <chandanrlinux@gmail.com>
    Reviewed-by: Darrick J. Wong <darrick.wong@oracle.com>
    Signed-off-by: Darrick J. Wong <darrick.wong@oracle.com>

diff --git a/fs/xfs/libxfs/xfs_log_format.h b/fs/xfs/libxfs/xfs_log_format.h
index 9bac0d2e56dc..e3400c9c71cd 100644
--- a/fs/xfs/libxfs/xfs_log_format.h
+++ b/fs/xfs/libxfs/xfs_log_format.h
@@ -424,12 +424,10 @@ struct xfs_log_dinode {
 	/* structure must be padded to 64 bit alignment */
 };
 
-static inline uint xfs_log_dinode_size(int version)
-{
-	if (version == 3)
-		return sizeof(struct xfs_log_dinode);
-	return offsetof(struct xfs_log_dinode, di_next_unlinked);
-}
+#define xfs_log_dinode_size(mp)						\
+	(xfs_sb_version_has_v3inode(&(mp)->m_sb) ?			\
+		sizeof(struct xfs_log_dinode) :				\
+		offsetof(struct xfs_log_dinode, di_next_unlinked))
 
 /*
  * Buffer Log Format definitions

commit b7df5e92055c69666e3c82f31f193120d98f04e3
Author: Darrick J. Wong <darrick.wong@oracle.com>
Date:   Tue Jan 7 16:12:25 2020 -0800

    xfs: make struct xfs_buf_log_format have a consistent size
    
    Increase XFS_BLF_DATAMAP_SIZE by 1 to fill in the implied padding at the
    end of struct xfs_buf_log_format.  This makes the size consistent so
    that we can check it in xfs_ondisk.h, and will be needed once we start
    logging attribute values.
    
    On amd64 we get the following pahole:
    
    struct xfs_buf_log_format {
            short unsigned int         blf_type;       /*     0     2 */
            short unsigned int         blf_size;       /*     2     2 */
            short unsigned int         blf_flags;      /*     4     2 */
            short unsigned int         blf_len;        /*     6     2 */
            long long int              blf_blkno;      /*     8     8 */
            unsigned int               blf_map_size;   /*    16     4 */
            unsigned int               blf_data_map[16]; /*    20    64 */
            /* --- cacheline 1 boundary (64 bytes) was 20 bytes ago --- */
    
            /* size: 88, cachelines: 2, members: 7 */
            /* padding: 4 */
            /* last cacheline: 24 bytes */
    };
    
    But on i386 we get the following:
    
    struct xfs_buf_log_format {
            short unsigned int         blf_type;       /*     0     2 */
            short unsigned int         blf_size;       /*     2     2 */
            short unsigned int         blf_flags;      /*     4     2 */
            short unsigned int         blf_len;        /*     6     2 */
            long long int              blf_blkno;      /*     8     8 */
            unsigned int               blf_map_size;   /*    16     4 */
            unsigned int               blf_data_map[16]; /*    20    64 */
            /* --- cacheline 1 boundary (64 bytes) was 20 bytes ago --- */
    
            /* size: 84, cachelines: 2, members: 7 */
            /* last cacheline: 20 bytes */
    };
    
    Notice how the amd64 compiler inserts 4 bytes of padding to the end of
    the structure to ensure 8-byte alignment.  Prior to "xfs: fix memory
    corruption during remote attr value buffer invalidation" we would try to
    write to blf_data_map[17], which is harmless on amd64 but really bad on
    i386.
    
    This shouldn't cause any changes in the ondisk logging formats because
    the log code writes out the log vectors with the appropriate size for
    the log item's map_size, and log recovery treats the data_map array as a
    VLA.
    
    Signed-off-by: Darrick J. Wong <darrick.wong@oracle.com>
    Reviewed-by: Christoph Hellwig <hch@lst.de>

diff --git a/fs/xfs/libxfs/xfs_log_format.h b/fs/xfs/libxfs/xfs_log_format.h
index 8ef31d71a9c7..9bac0d2e56dc 100644
