commit 80a1608f33274ff3ce8d0d33ef8aaad245fb7bc6
Author: Leon Romanovsky <leonro@mellanox.com>
Date:   Sun Mar 1 16:44:50 2020 +0200

    net/emulex: Delete driver version
    
    Remove driver version in favor of general linux kernel version.
    
    Signed-off-by: Leon Romanovsky <leonro@mellanox.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/drivers/net/ethernet/emulex/benet/be.h b/drivers/net/ethernet/emulex/benet/be.h
index cf3e6f2892ff..6e9022083004 100644
--- a/drivers/net/ethernet/emulex/benet/be.h
+++ b/drivers/net/ethernet/emulex/benet/be.h
@@ -33,7 +33,6 @@
 #include "be_hw.h"
 #include "be_roce.h"
 
-#define DRV_VER			"12.0.0.0"
 #define DRV_NAME		"be2net"
 #define BE_NAME			"Emulex BladeEngine2"
 #define BE3_NAME		"Emulex BladeEngine3"

commit 9041f047df3afe545089173e5ae71592382de169
Author: Ivan Vecera <ivecera@redhat.com>
Date:   Fri Aug 16 09:15:35 2019 +0200

    be2net: eliminate enable field from be_aic_obj
    
    Adaptive coalescing is managed per adapter not per event queue so it
    does not needed to store 'enable' flag for each event queue.
    
    Signed-off-by: Ivan Vecera <ivecera@redhat.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/drivers/net/ethernet/emulex/benet/be.h b/drivers/net/ethernet/emulex/benet/be.h
index f287b5da5546..cf3e6f2892ff 100644
--- a/drivers/net/ethernet/emulex/benet/be.h
+++ b/drivers/net/ethernet/emulex/benet/be.h
@@ -192,7 +192,6 @@ struct be_eq_obj {

    Disable chip will reduce module size by:
    BE2 ~2kb
    BE3 ~3kb
    Lancer ~10kb
    Skyhawk ~9kb
    
    When enable skyhawk only it will reduce module size by ~20kb
    
    New help style in Kconfig
    
    Reviewed-by: Ivan Vecera <ivecera@redhat.com>
    Signed-off-by: Petr Oros <poros@redhat.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/drivers/net/ethernet/emulex/benet/be.h b/drivers/net/ethernet/emulex/benet/be.h
index d80fe03d3107..58bcee8f0a58 100644
--- a/drivers/net/ethernet/emulex/benet/be.h
+++ b/drivers/net/ethernet/emulex/benet/be.h
@@ -752,17 +752,33 @@ static inline u16 be_max_any_irqs(struct be_adapter *adapter)
 /* Is BE in QNQ multi-channel mode */
 #define be_is_qnq_mode(adapter)		(adapter->function_mode & QNQ_MODE)
 
+#ifdef CONFIG_BE2NET_LANCER
 #define lancer_chip(adapter)	(adapter->pdev->device == OC_DEVICE_ID3 || \
 				 adapter->pdev->device == OC_DEVICE_ID4)
+#else
+#define lancer_chip(adapter)	(0)
+#endif /* CONFIG_BE2NET_LANCER */
 
+#ifdef CONFIG_BE2NET_SKYHAWK
 #define skyhawk_chip(adapter)	(adapter->pdev->device == OC_DEVICE_ID5 || \
 				 adapter->pdev->device == OC_DEVICE_ID6)
+#else
+#define skyhawk_chip(adapter)	(0)
+#endif /* CONFIG_BE2NET_SKYHAWK */
 
+#ifdef CONFIG_BE2NET_BE3
 #define BE3_chip(adapter)	(adapter->pdev->device == BE_DEVICE_ID2 || \
 				 adapter->pdev->device == OC_DEVICE_ID2)
+#else
+#define BE3_chip(adapter)	(0)
+#endif /* CONFIG_BE2NET_BE3 */
 
+#ifdef CONFIG_BE2NET_BE2
 #define BE2_chip(adapter)	(adapter->pdev->device == BE_DEVICE_ID1 || \
 				 adapter->pdev->device == OC_DEVICE_ID1)
+#else
+#define BE2_chip(adapter)	(0)
+#endif /* CONFIG_BE2NET_BE2 */
 
 #define BEx_chip(adapter)	(BE3_chip(adapter) || BE2_chip(adapter))
 

commit 40c0066412be25aa6a706ba5eae54db23ee8ade2
Author: Suresh Reddy <suresh.reddy@broadcom.com>
Date:   Tue Jul 31 11:39:43 2018 -0400

    be2net: Update the driver version to 12.0.0.0
    
    Signed-off-by: Suresh Reddy <suresh.reddy@broadcom.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/drivers/net/ethernet/emulex/benet/be.h b/drivers/net/ethernet/emulex/benet/be.h
index 7005949dc17b..d80fe03d3107 100644
--- a/drivers/net/ethernet/emulex/benet/be.h
+++ b/drivers/net/ethernet/emulex/benet/be.h
@@ -37,7 +37,7 @@
 #include "be_hw.h"
 #include "be_roce.h"
 
-#define DRV_VER			"11.4.0.0"
+#define DRV_VER			"12.0.0.0"
 #define DRV_NAME		"be2net"
 #define BE_NAME			"Emulex BladeEngine2"
 #define BE3_NAME		"Emulex BladeEngine3"

commit 28ace84b10fa5a1bb542ee7198743e3c02e23a07
Author: Ivan Vecera <cera@cera.cz>
Date:   Tue Jul 10 22:59:48 2018 +0200

    be2net: move rss_flags field in rss_info to ensure proper alignment
    
    The current position of .rss_flags field in struct rss_info causes
    that fields .rsstable and .rssqueue (both 128 bytes long) crosses
    cache-line boundaries. Moving it at the end properly align all fields.
    
    Before patch:
    struct rss_info {
            u64                        rss_flags;            /*     0     8 */
            u8                         rsstable[128];        /*     8   128 */
            /* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
            u8                         rss_queue[128];       /*   136   128 */
            /* --- cacheline 4 boundary (256 bytes) was 8 bytes ago --- */
            u8                         rss_hkey[40];         /*   264    40 */
    };
    
    After patch:
    struct rss_info {
            u8                         rsstable[128];        /*     0   128 */
            /* --- cacheline 2 boundary (128 bytes) --- */
            u8                         rss_queue[128];       /*   128   128 */
            /* --- cacheline 4 boundary (256 bytes) --- */
            u8                         rss_hkey[40];         /*   256    40 */
            u64                        rss_flags;            /*   296     8 */
    };
    
    Signed-off-by: Ivan Vecera <cera@cera.cz>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/drivers/net/ethernet/emulex/benet/be.h b/drivers/net/ethernet/emulex/benet/be.h
index 4f805be43180..7005949dc17b 100644
--- a/drivers/net/ethernet/emulex/benet/be.h
+++ b/drivers/net/ethernet/emulex/benet/be.h
@@ -436,10 +436,10 @@ struct be_port_resources {
 #define be_is_os2bmc_enabled(adapter) (adapter->flags & BE_FLAGS_OS2BMC)
 
 struct rss_info {
-	u64 rss_flags;
 	u8 rsstable[RSS_INDIR_TABLE_LEN];
 	u8 rss_queue[RSS_INDIR_TABLE_LEN];
 	u8 rss_hkey[RSS_HASH_KEY_LEN];
+	u64 rss_flags;
 };
 
 #define BE_INVALID_DIE_TEMP	0xFF

commit 03d231a963ae1179d05f552db75b661d1099272f
Author: Ivan Vecera <cera@cera.cz>
Date:   Tue Jul 10 22:59:47 2018 +0200

    be2net: re-order fields in be_error_recovert to avoid hole
    
    - Unionize two u8 fields where only one of them is used depending on NIC
    chipset.
    - Move recovery_supported field after that union
    
    These changes eliminate 7-bytes hole in the struct and makes it smaller
    by 8 bytes.
    
    Signed-off-by: Ivan Vecera <cera@cera.cz>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/drivers/net/ethernet/emulex/benet/be.h b/drivers/net/ethernet/emulex/benet/be.h
index d521364e17cf..4f805be43180 100644
--- a/drivers/net/ethernet/emulex/benet/be.h
+++ b/drivers/net/ethernet/emulex/benet/be.h
@@ -522,11 +522,13 @@ enum {
 };
 
 struct be_error_recovery {
-	/* Lancer error recovery variables */
-	u8 recovery_retries;
+	union {
+		u8 recovery_retries;	/* used for Lancer		*/
+		u8 recovery_state;	/* used for BEx and Skyhawk	*/
+	};
 
 	/* BEx/Skyhawk error recovery variables */
-	u8 recovery_state;
+	bool recovery_supported;
 	u16 ue_to_reset_time;		/* Time after UE, to soft reset
 					 * the chip - PF0 only
 					 */
@@ -534,7 +536,6 @@ struct be_error_recovery {
 					 * of SLIPORT_SEMAPHORE reg
 					 */
 	u16 last_err_code;
-	bool recovery_supported;
 	unsigned long probe_time;
 	unsigned long last_recovery_time;
 

commit f9520b86dc22b6ac0ad2926cfa334e9fecb68a12
Author: Ivan Vecera <cera@cera.cz>
Date:   Tue Jul 10 22:59:46 2018 +0200

    be2net: remove unused tx_jiffies field from be_tx_stats
    
    Signed-off-by: Ivan Vecera <cera@cera.cz>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/drivers/net/ethernet/emulex/benet/be.h b/drivers/net/ethernet/emulex/benet/be.h
index 91ca8d132e87..d521364e17cf 100644
--- a/drivers/net/ethernet/emulex/benet/be.h
+++ b/drivers/net/ethernet/emulex/benet/be.h
@@ -217,7 +217,6 @@ struct be_tx_stats {
 	u64 tx_vxlan_offload_pkts;
 	u64 tx_reqs;
 	u64 tx_compl;
-	ulong tx_jiffies;
 	u32 tx_stops;
 	u32 tx_drv_drops;	/* pkts dropped by driver */
 	/* the error counters are described in be_ethtool.c */

commit 646d2c10aaa060281b4ce7c1d3649d7df2ba9e7f
Author: Ivan Vecera <cera@cera.cz>
Date:   Tue Jul 10 22:59:45 2018 +0200

    be2net: move txcp field in be_tx_obj to eliminate holes in the struct
    
    Before patch:
    struct be_tx_obj {
            u32                        db_offset;            /*     0     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            struct be_queue_info       q;                    /*     8    56 */
            /* --- cacheline 1 boundary (64 bytes) --- */
            struct be_queue_info       cq;                   /*    64    56 */
            struct be_tx_compl_info    txcp;                 /*   120     4 */
    
            /* XXX 4 bytes hole, try to pack */
    
            /* --- cacheline 2 boundary (128 bytes) --- */
            struct sk_buff *           sent_skb_list[2048];  /*   128 16384 */
            ...
    }:
    
    After patch:
    struct be_tx_obj {
            u32                        db_offset;            /*     0     4 */
            struct be_tx_compl_info    txcp;                 /*     4     4 */
            struct be_queue_info       q;                    /*     8    56 */
            /* --- cacheline 1 boundary (64 bytes) --- */
            struct be_queue_info       cq;                   /*    64    56 */
            struct sk_buff *           sent_skb_list[2048];  /*   120 16384 */
            ...
    };
    
    Signed-off-by: Ivan Vecera <cera@cera.cz>
    Signed-off-by: David S. Miller <davem@davemloft.net>

diff --git a/drivers/net/ethernet/emulex/benet/be.h b/drivers/net/ethernet/emulex/benet/be.h
index 716b4bc410f5..91ca8d132e87 100644
--- a/drivers/net/ethernet/emulex/benet/be.h
+++ b/drivers/net/ethernet/emulex/benet/be.h
@@ -240,9 +240,9 @@ struct be_tx_compl_info {
 
 struct be_tx_obj {
 	u32 db_offset;
+	struct be_tx_compl_info txcp;
 	struct be_queue_info q;
 	struct be_queue_info cq;
-	struct be_tx_compl_info txcp;
 	/* Remember the skbs that were transmitted */
 	struct sk_buff *sent_skb_list[TX_Q_LEN];
 	struct be_tx_stats stats;

commit e9c74cd85c00e46bff62d3bb2ce8c5fd02bf465e
Author: Ivan Vecera <cera@cera.cz>
Date:   Tue Jul 10 22:59:44 2018 +0200

    be2net: reorder fields in be_eq_obj structure
    
    Re-order fields in struct be_eq_obj to ensure that .napi field begins
